var bcv_regexps = class {
  constructor() {
    this.books = [];
    this.languages = ["arb"];
    this.translations = [/(?:GNA93DC|GNA93|(?:AVDD|GO|[CN]A)V|TMA-C|FAOV|AVD|ARB|SA[BT])\b/gi];
    this.first = /(?:1\.?\s*|الأولى\.?\s*|الاولى\.?\s*|رسالة\.?\s*|رِسَالَةُ\.?\s*|رسالة\.?\s*|رِسَالَة\.?\s*|رِسَالةُ\.?\s*|رِسَالة\.?\s*|رِسالَةُ\.?\s*|رِسالَة\.?\s*|رِسالةُ\.?\s*|رِسالة\.?\s*|رسَالَةُ\.?\s*|رسَالَة\.?\s*|رسَالةُ\.?\s*|رسَالة\.?\s*|رسالَةُ\.?\s*|رسالَة\.?\s*|رسالةُ\.?\s*|سفر\.?\s*|من\.?\s*)/;
    this.second = /(?:2\.?\s*|الثانية\.?\s*|رسالة\.?\s*|رِسَالَةُ\.?\s*|رسالة\.?\s*|رِسَالَة\.?\s*|رِسَالةُ\.?\s*|رِسَالة\.?\s*|رِسالَةُ\.?\s*|رِسالَة\.?\s*|رِسالةُ\.?\s*|رِسالة\.?\s*|رسَالَةُ\.?\s*|رسَالَة\.?\s*|رسَالةُ\.?\s*|رسَالة\.?\s*|رسالَةُ\.?\s*|رسالَة\.?\s*|رسالةُ\.?\s*|سفر\.?\s*|من\.?\s*)/;
    this.third = /3\.?\s*/;
    this.range_and = /(?:[&\u2013\u2014-]|\x26\.?\s*|(?:\x2d\.?\s*|–\.?\s*|—\.?\s*))/;
    this.range_only = /(?:[\u2013\u2014-]|(?:\x2d\.?\s*|–\.?\s*|—\.?\s*))/;
    this.match_end_split = /\d\W*(?:title)|\d\W*(?:ff)(?:[\s*]*\.)?|\d[\s*]*(?:(?:[a-e](?!\w)))|\x1e(?:[\s*]*[)\]\uff09])?|[\d\x1f]/gi;
    this.control = /[\x1e\x1f]/g;
    this.escaped_passage = /(?:^|[^\x1e\x1f\p{L}\p{N}])((?:(?:ch(?:apters?|a?pts?\.?|a?p?s?\.?)?\s*\d+\s*(?:[\u2013\u2014\-]|through|thru|to)\s*\d+\s*(?:from|of|in)(?:\s+the\s+book\s+of)?\s*)|(?:ch(?:apters?|a?pts?\.?|a?p?s?\.?)?\s*\d+\s*(?:from|of|in)(?:\s+the\s+book\s+of)?\s*)|(?:\d+(?:th|nd|st)\s*ch(?:apter|a?pt\.?|a?p?\.?)?\s*(?:from|of|in)(?:\s+the\s+book\s+of)?\s*))?\x1f(\d+)(?:\/\d+)?\x1f(?:\/\d+\x1f|[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—]|title\.?\s*(?![a-z])|(?:(?:chapter\.?\s*)|(?:verse\.?\s*)|(?:ff\.?\s*)|(?:&\.?\s*)|(?:[\-–—]\.?\s*))|(?:[a-e]\.?\s*(?!\w))(?!\w)|$)+)/giu;
    this.pre_book = /(?:^|(?<=[^\p{L}]))/gu;
    this.pre_number_book = /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))/gu;
    this.post_book = /(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/gu;
    this.all_books = [
          {
            osis: ["Ps"],
            testament: "a",
            extra: "2",
            regexp: /\b(Ps151)(?=\.1\b)/g
          },
          {
            osis: ["Gen"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:قصص\s*ال[أا]نبياء\s*-\s*التّ?كوين|ا(?:َلت(?:َ?ّك(?:ْوِ?ينُ|وِ?ينُ)|َ?ك(?:ْوِ?ينُ|وِ?ينُ))|لت(?:َ?ّك(?:ْوِ?ينُ|وِ?ينُ)|َ?ك(?:ْوِ?ينُ|وِ?ينُ)))|ا(?:َلت(?:َ?ّك(?:ْوِ?ين|وِ?ين)|َ?ك(?:ْوِ?ين|وِ?ين))|لت(?:َ?ّك(?:ْوِ?ين|وِ?ين)|َ?ك(?:ْوِ?ين|وِ?ين)))|تكوين|تك))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Exod"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:قص(?:ّة\s*الن(?:ّبيّ?\s*موسى\s*-\s*الخروج|بيّ?\s*موسى\s*-\s*الخروج)|ة\s*الن(?:ّبيّ?\s*موسى\s*-\s*الخروج|بيّ?\s*موسى\s*-\s*الخروج))|ا(?:َل(?:ْخ(?:ُرُ?وجُ|رُ?وجُ)|خ(?:ُرُ?وجُ|رُ?وجُ))|ل(?:ْخ(?:ُرُ?وجُ|رُ?وجُ)|خ(?:ُرُ?وجُ|رُ?وجُ)))|ا(?:َل(?:ْخ(?:ُرُ?وج|رُ?وج)|خ(?:ُرُ?وج|رُ?وج))|ل(?:ْخ(?:ُرُ?وج|رُ?وج)|خ(?:ُرُ?وج|رُ?وج)))|سفر\s*الخروج|خرُوج|خروج|خر))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Lev"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:قص(?:ّة\s*النبيّ?\s*موسى\s*–\s*من\s*اللاويين|ة\s*النبيّ?\s*موسى\s*–\s*من\s*اللاويين)|ا(?:َلل(?:َ?ّاو(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ)|َ?او(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ))|ل(?:ل(?:َ?ّاو(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ)|َ?او(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ))|[أا]حبار))|ا(?:َلل(?:َ?ّاو(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين)|َ?او(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين))|لل(?:َ?ّاو(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين)|َ?او(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين)))|(?:سفر\s*اللاويـ|لَ?اويّ)ين|لَ?اويين|لا))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Num"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:قصّ?ة\s*النبي\s*موسى\s*-\s*من\s*العدد|(?:ا(?:َل(?:ْعَ?دَ|عَ?دَ)|ل(?:ْعَ?دَ|عَ?دَ))|عَ?دَ)د|سفر\s*العدد|ا(?:َل(?:ْعَ?دد|عَ?دد)|ل(?:ْعَ?دد|عَ?دد))|عَ?دد|عد))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Sir"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))((?:يشوع\s*بن\s*سيراخ|سي))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Wis"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))((?:الحكمة|حك))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Lam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:من\s*مراثي\s*(?:الن(?:ّبي(?:ّ\s*[إا]|\s*[إا])|بي(?:ّ\s*[إا]|\s*[إا]))|إ)رميا|م(?:َر(?:َاث(?:ِي\s*[إا](?:ِر(?:ْمِ?يَ|مِ?يَ)|ر(?:ْمِ?يَ|مِ?يَ))|ي\s*[إا](?:ِر(?:ْمِ?يَ|مِ?يَ)|ر(?:ْمِ?يَ|مِ?يَ)))|اث(?:ِي\s*[إا](?:ِر(?:ْمِ?يَ|مِ?يَ)|ر(?:ْمِ?يَ|مِ?يَ))|ي\s*[إا](?:ِر(?:ْمِ?يَ|مِ?يَ)|ر(?:ْمِ?يَ|مِ?يَ))))|ر(?:َاث(?:ِي\s*[إا](?:ِر(?:ْمِ?يَ|مِ?يَ)|ر(?:ْمِ?يَ|مِ?يَ))|ي\s*[إا](?:ِر(?:ْمِ?يَ|مِ?يَ)|ر(?:ْمِ?يَ|مِ?يَ)))|اث(?:ِي\s*[إا](?:ِر(?:ْمِ?يَ|مِ?يَ)|ر(?:ْمِ?يَ|مِ?يَ))|ي\s*[إا](?:ِر(?:ْمِ?يَ|مِ?يَ)|ر(?:ْمِ?يَ|مِ?يَ)))))ا|م(?:َر(?:َاث(?:ِي\s*[إا](?:ِر(?:ْمِ?يا|مِ?يا)|ر(?:ْمِ?يا|مِ?يا))|ي\s*[إا](?:ِر(?:ْمِ?يا|مِ?يا)|ر(?:ْمِ?يا|مِ?يا)))|اث(?:ِي\s*[إا](?:ِر(?:ْمِ?يا|مِ?يا)|ر(?:ْمِ?يا|مِ?يا))|ي\s*[إا](?:ِر(?:ْمِ?يا|مِ?يا)|ر(?:ْمِ?يا|مِ?يا))))|ر(?:َاث(?:ِي\s*[إا](?:ِر(?:ْمِ?يا|مِ?يا)|ر(?:ْمِ?يا|مِ?يا))|ي\s*[إا](?:ِر(?:ْمِ?يا|مِ?يا)|ر(?:ْمِ?يا|مِ?يا)))|اث(?:ِي\s*[إا](?:ِر(?:ْمِ?يا|مِ?يا)|ر(?:ْمِ?يا|مِ?يا))|ي\s*[إا](?:ِر(?:ْمِ?يا|مِ?يا)|ر(?:ْمِ?يا|مِ?يا)))))|م(?:َر(?:َاث(?:ِي\s*[إا]ر(?:ْمِ?ي|مِ?ي)|ي\s*[إا]ر(?:ْمِ?ي|مِ?ي))|اث(?:ِي\s*[إا]ر(?:ْمِ?ي|مِ?ي)|ي\s*[إا]ر(?:ْمِ?ي|مِ?ي)))|ر(?:َاث(?:ِي\s*[إا]ر(?:ْمِ?ي|مِ?ي)|ي\s*[إا]ر(?:ْمِ?ي|مِ?ي))|ا(?:ث(?:ِي\s*[إا]ر(?:ْمِ?ي|مِ?ي)|ي\s*[إا]ر(?:ْمِ?ي|مِ?ي)))?))|سفر\s*مراثي\s*ارميا|من\s*مراثي\s*ارميا|المراثي))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["EpJer"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))((?:رسالة\s*[إا]رميا|[إا]ر\s*\(يو\)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Rev"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ر(?:ُ(?:ؤْيا\s*(?:القِدِّيس\s*يُوحَنَّا\s*اللاهوتي|ي(?:ُوح(?:َنَ?ا|نَ?ا)|وح(?:َنَ?ا|نَ?ا)))|ؤْيَا\s*ي(?:ُوح(?:َنَ?ا|نَ?ا)|وح(?:َنَ?ا|نَ?ا))|و(?:ْي(?:َا\s*ي(?:ُوح(?:َنَ?ا|نَ?ا)|وح(?:َنَ?ا|نَ?ا))|ا\s*ي(?:ُوح(?:َنَ?ا|نَ?ا)|وح(?:َنَ?ا|نَ?ا)))|يَ?ا\s*ي(?:ُوح(?:َنَ?ا|نَ?ا)|وح(?:َنَ?ا|نَ?ا)))|ؤيَ?ا\s*ي(?:ُوح(?:َنَ?ا|نَ?ا)|وح(?:َنَ?ا|نَ?ا)))|ويا\s*(?:القديس\s*يوحنا\s*اللاهوتي|ي(?:ُوح(?:َنَ?ا|نَ?ا)|وح(?:َنَ?ا|نَ?ا)))|[ؤو]ْي(?:َا\s*ي(?:ُوح(?:َنَ?ا|نَ?ا)|وح(?:َنَ?ا|نَ?ا))|ا\s*ي(?:ُوح(?:َنَ?ا|نَ?ا)|وح(?:َنَ?ا|نَ?ا)))|(?:ويَا\s*|ؤيَ?ا\s*)ي(?:ُوح(?:َنَ?ا|نَ?ا)|وح(?:َنَ?ا|نَ?ا)))|ر(?:ُ(?:ؤْيَا\s*ي(?:ُوح(?:َنَ?ّ|نَ?ّ)|وح(?:َنَ?ّ|نَ?ّ))|و(?:ْي(?:َا\s*ي(?:ُوح(?:َنَ?ّ|نَ?ّ)|وح(?:َنَ?ّ|نَ?ّ))|ا\s*ي(?:ُوح(?:َنَ?ّ|نَ?ّ)|وح(?:َنَ?ّ|نَ?ّ)))|يَ?ا\s*ي(?:ُوح(?:َنَ?ّ|نَ?ّ)|وح(?:َنَ?ّ|نَ?ّ)))|ؤْيا\s*ي(?:ُوح(?:َنَ?ّ|نَ?ّ)|وح(?:َنَ?ّ|نَ?ّ))|ؤيَ?ا\s*ي(?:ُوح(?:َنَ?ّ|نَ?ّ)|وح(?:َنَ?ّ|نَ?ّ)))|[ؤو]ْي(?:َا\s*ي(?:ُوح(?:َنَ?ّ|نَ?ّ)|وح(?:َنَ?ّ|نَ?ّ))|ا\s*ي(?:ُوح(?:َنَ?ّ|نَ?ّ)|وح(?:َنَ?ّ|نَ?ّ)))|(?:ويَا\s*|ؤيَ?ا\s*)ي(?:ُوح(?:َنَ?ّ|نَ?ّ)|وح(?:َنَ?ّ|نَ?ّ))|ويا\s*ي(?:ُوح(?:َنَ?ّ|نَ?ّ)|وح(?:َنَ?ّ|نَ?ّ)))ا|Rou2ya\s*You7anna|كتاب\s*الر[ؤو]يا|ر(?:ُ(?:ؤيَ?ا|ويَ?ا)|ويَا|ؤيَ?ا|و(?:يا)?|ؤ)|الر[ؤو]يا))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Deut"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:قصّ?ة\s*النبي\s*موسى\s*–\s*من\s*التثنية|ت(?:ث(?:ن(?:ية\s*الاشتراع|ِية)|ْنِ?ية)|َث(?:ْنِ?ية|نِ?ية))|(?:ا(?:َلت(?:َ?ّث(?:ْنِ?يَ|نِ?يَ)|َ?ث(?:ْنِ?يَ|نِ?يَ))|لت(?:َ?ّث(?:ْنِ?يَ|نِ?يَ)|َ?ث(?:ْنِ?يَ|نِ?يَ)))|تَث(?:ْنِ?يَ|نِ?يَ)|تثْنِ?يَ|تثنِ?يَ)ة|ا(?:َلت(?:َ?ّث(?:ْنِ?ية|نِ?ية)|َ?ث(?:ْنِ?ية|نِ?ية))|لت(?:َ?ّث(?:ْنِ?ية|نِ?ية)|َ?ث(?:ْنِ?ية|نِ?ية)))|سفر\s*التـثنية|تث(?:نية)?))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Josh"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:يش(?:وع\s*بن\s*نون|(?:وع)?)|سفر\s*يشوع|يَ?شُوع|ي(?:َشو|وش)ع))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Judg"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:(?:ا(?:َل(?:ْقُ?ضَ|قُ?ضَ)|ل(?:ْقُ?ضَ|قُ?ضَ))|قُ?ضَ)اة|سفر\s*القضاة|(?:ا(?:َل(?:ْقُ?ضا|قُ?ضا)|ل(?:ْقُ?ضا|قُ?ضا))|قُ?ضا)ة|قض))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ruth"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:قص(?:ّة\s*راعوث\s*الم[ؤو]منة|ة\s*راعوث\s*الم[ؤو]منة)|سفر\s*راعوث|رَ?اعُوث|ر(?:َاعوث|اعو[تث])|را))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Isa"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:من\s*الوحي\s*[إا]لى\s*[أا]شعيا|[إا](?:ِش(?:َع(?:ْيَ?اءَ|يَ?اءَ)|ع(?:ْيَ?اءَ|يَ?اءَ))|شَع(?:ْيَ?اءَ|يَ?اءَ)|شعْيَ?اءَ|شعيَ?اءَ)|[إا](?:ِش(?:َع(?:ْيَ?اء|يَ?اء)|ع(?:ْيَ?اء|يَ?اء))|ش(?:َع(?:ْيَ?اء|يَ?اء)|(?:عْيَ?اء|(?:عيَاء|(?:عياء|(?:عيا)?)))))|(?:سفر\s*[إا]|أ)شعيا))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Sam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ص(?:َمُوئِيلَ\s*ٱلْأَوَّلُ|مو(?:ئيل\s*ال[أا]وّل|ييل\s*(?:ال[أا]وّل|ال[أا]ول|ٱلاول)|ئيل\s*ال[أا]ول))|قص(?:ّة\s*صمو[ئي]يل\s*وداود|ة\s*صمو[ئي]يل\s*وداود)|1صمويل|1صم))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Sam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ص(?:َم(?:ُو[ئي](?:ِيل(?:َ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))|يل(?:َ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)))|و[ئي](?:ِيل(?:َ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))|يل(?:َ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))))|مُو[ئي](?:ِيل(?:َ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))|يل(?:َ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)))|مو[ئي]ِيل(?:َ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))|مو[ئي]يلَ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|مو[ئي]يل\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|مو[ئي]يل\s*الثاني)|2صم(?:ويل)?))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Sam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:ر(?:ِس(?:َالَ?ةُ|الَ?ةُ)|س(?:َالَ?ةُ|الَ?ةُ))|سفر|من|1)(?:\.\s*ص(?:مو[ئي]يل\s*ال[أا]ول|َم(?:ُو[ئي]ِ?يل|و[ئي]ِ?يل)|مُو[ئي]ِ?يل|مو[ئي]ِيل|م(?:و[ئي]يل)?)|\s*ص(?:مو[ئي]يل\s*ال[أا]ول|َم(?:ُو[ئي]ِ?يل|و[ئي]ِ?يل)|مُو[ئي]ِ?يل|مو[ئي]ِيل|م(?:و[ئي]يل)?))|ر(?:ِس(?:َالَ?ة\.|الَ?ة\.)|س(?:َالَ?ة\.|الَ?ة\.))\s*ص(?:مو[ئي]يل\s*ال[أا]ول|َم(?:ُو[ئي]ِ?يل|و[ئي]ِ?يل)|مُو[ئي]ِ?يل|مو[ئي]ِيل|م(?:و[ئي]يل)?)|ر(?:ِس(?:َالَ?ة\s*|الَ?ة\s*)|س(?:َالَ?ة\s*|الَ?ة\s*))ص(?:مو[ئي]يل\s*ال[أا]ول|َم(?:ُو[ئي]ِ?يل|و[ئي]ِ?يل)|مُو[ئي]ِ?يل|مو[ئي]ِيل|م(?:و[ئي]يل)?)|ال[أا]ولى(?:\.\s*ص(?:مو[ئي]يل\s*ال[أا]ول|َم(?:ُو[ئي]ِ?يل|و[ئي]ِ?يل)|مُو[ئي]ِ?يل|مو[ئي]ِيل|م(?:و[ئي]يل)?)|\s*ص(?:مو[ئي]يل\s*ال[أا]ول|َم(?:ُو[ئي]ِ?يل|و[ئي]ِ?يل)|مُو[ئي]ِ?يل|مو[ئي]ِيل|م(?:و[ئي]يل)?))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Sam"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:ر(?:ِس(?:َالَ?ةُ|الَ?ةُ)|س(?:َالَ?ةُ|الَ?ةُ))|سفر|من|2)(?:\.\s*(?:قص(?:ّة\s*النبيّ?\s*داود|ة\s*النبيّ?\s*داود)|ص(?:(?:مو[ئي]يل\s*الثاني|َم(?:ُو[ئي]ِ?يل|و[ئي]ِ?يل)|مُو[ئي]ِ?يل|مو[ئي]ِيل)|م(?:و[ئي]يل)?))|\s*(?:قص(?:ّة\s*النبيّ?\s*داود|ة\s*النبيّ?\s*داود)|ص(?:(?:مو[ئي]يل\s*الثاني|َم(?:ُو[ئي]ِ?يل|و[ئي]ِ?يل)|مُو[ئي]ِ?يل|مو[ئي]ِيل)|م(?:و[ئي]يل)?)))|ر(?:ِس(?:َالَ?ة\.|الَ?ة\.)|س(?:َالَ?ة\.|الَ?ة\.))\s*(?:قص(?:ّة\s*النبيّ?\s*داود|ة\s*النبيّ?\s*داود)|ص(?:(?:مو[ئي]يل\s*الثاني|َم(?:ُو[ئي]ِ?يل|و[ئي]ِ?يل)|مُو[ئي]ِ?يل|مو[ئي]ِيل)|م(?:و[ئي]يل)?))|ر(?:ِس(?:َالَ?ة\s*|الَ?ة\s*)|س(?:َالَ?ة\s*|الَ?ة\s*))(?:قص(?:ّة\s*النبيّ?\s*داود|ة\s*النبيّ?\s*داود)|ص(?:(?:مو[ئي]يل\s*الثاني|َم(?:ُو[ئي]ِ?يل|و[ئي]ِ?يل)|مُو[ئي]ِ?يل|مو[ئي]ِيل)|م(?:و[ئي]يل)?))|الثانية(?:\.\s*(?:قص(?:ّة\s*النبيّ?\s*داود|ة\s*النبيّ?\s*داود)|ص(?:(?:مو[ئي]يل\s*الثاني|َم(?:ُو[ئي]ِ?يل|و[ئي]ِ?يل)|مُو[ئي]ِ?يل|مو[ئي]ِيل)|م(?:و[ئي]يل)?))|\s*(?:قص(?:ّة\s*النبيّ?\s*داود|ة\s*النبيّ?\s*داود)|ص(?:(?:مو[ئي]يل\s*الثاني|َم(?:ُو[ئي]ِ?يل|و[ئي]ِ?يل)|مُو[ئي]ِ?يل|مو[ئي]ِيل)|م(?:و[ئي]يل)?)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Kgs"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:قصص\s*سليمان\s*و[إا]لياس\s*واليسع|ا(?:َلْمُلُوكِ\s*ٱلْأَوَّلُ|لملوك\s*(?:ال[أا]وّل|ال[أا]ول|ٱلاول))|ملوك\s*ال[أا]ول|1ملوك|1مل))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Kgs"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ا(?:َل(?:ْم(?:ُل(?:ُوك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))|وك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)))|ل(?:ُوك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))|وك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))))|م(?:ُل(?:ُوك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))|وك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)))|ل(?:ُوك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))|وك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)))))|ل(?:ْم(?:ُل(?:ُوك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))|وك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)))|ل(?:ُوك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))|وك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))))|م(?:ُل(?:ُوك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))|وك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)))|ل(?:ُوك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي))|وك(?:ِ\s*ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|\s*(?:ٱلث(?:َ?ّانِ?ي|َ?انِ?ي)|الثاني))))))|ملوك\s*الثاني|2مل(?:وك)?))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Kgs"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:ر(?:ِس(?:َالَ?ةُ|الَ?ةُ)|س(?:َالَ?ةُ|الَ?ةُ))|سفر|من|1)(?:\.\s*(?:الملوك\s*ال[أا]ول|م(?:(?:ُلُ?وك|لُ?وك)|ل))|\s*(?:الملوك\s*ال[أا]ول|م(?:(?:ُلُ?وك|لُ?وك)|ل)))|ر(?:ِس(?:َالَ?ة\.|الَ?ة\.)|س(?:َالَ?ة\.|الَ?ة\.))\s*(?:الملوك\s*ال[أا]ول|م(?:(?:ُلُ?وك|لُ?وك)|ل))|ر(?:ِس(?:َالَ?ة\s*|الَ?ة\s*)|س(?:َالَ?ة\s*|الَ?ة\s*))(?:الملوك\s*ال[أا]ول|م(?:(?:ُلُ?وك|لُ?وك)|ل))|ال[أا]ولى(?:\.\s*(?:الملوك\s*ال[أا]ول|م(?:(?:ُلُ?وك|لُ?وك)|ل))|\s*(?:الملوك\s*ال[أا]ول|م(?:(?:ُلُ?وك|لُ?وك)|ل)))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Kgs"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:ر(?:ِس(?:َالَ?ةُ|الَ?ةُ)|س(?:َالَ?ةُ|الَ?ةُ))|سفر|من|2)(?:\.\s*(?:قص(?:ّة\s*[إا]لياس\s*واليسع|ة\s*[إا]لياس\s*واليسع)|الملوك\s*الثاني|م(?:ُلُ?وك|لُ?وك)|مل)|\s*(?:قص(?:ّة\s*[إا]لياس\s*واليسع|ة\s*[إا]لياس\s*واليسع)|الملوك\s*الثاني|م(?:ُلُ?وك|لُ?وك)|مل))|ر(?:ِس(?:َالَ?ة\.|الَ?ة\.)|س(?:َالَ?ة\.|الَ?ة\.))\s*(?:قص(?:ّة\s*[إا]لياس\s*واليسع|ة\s*[إا]لياس\s*واليسع)|الملوك\s*الثاني|م(?:ُلُ?وك|لُ?وك)|مل)|ر(?:ِس(?:َالَ?ة\s*|الَ?ة\s*)|س(?:َالَ?ة\s*|الَ?ة\s*))(?:قص(?:ّة\s*[إا]لياس\s*واليسع|ة\s*[إا]لياس\s*واليسع)|الملوك\s*الثاني|م(?:ُلُ?وك|لُ?وك)|مل)|الثانية(?:\.\s*(?:قص(?:ّة\s*[إا]لياس\s*واليسع|ة\s*[إا]لياس\s*واليسع)|الملوك\s*الثاني|م(?:ُلُ?وك|لُ?وك)|مل)|\s*(?:قص(?:ّة\s*[إا]لياس\s*واليسع|ة\s*[إا]لياس\s*واليسع)|الملوك\s*الثاني|م(?:ُلُ?وك|لُ?وك)|مل))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Chr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:أ(?:َخْبَارِ\s*ٱلْأَوَّلُ|خبار\s*ال[أا]يام\s*ال[أا]ول)|اخبار\s*ال[أا]يام\s*ال[أا]ول|ال[أا]خبار\s*ال[أا]وّل|ال[أا]خبار\s*ال[أا]ول|اخبار\s*ٱلاول|1[أا]خبار|1[أا]خ))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Chr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:أ(?:َخ(?:ْب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ))|ب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ)))|خ(?:ْب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ))|ب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ))))ي|أخبار\s*ال[أا]يام\s*الثاني|ا(?:(?:َخ(?:ْب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ))|ب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ)))|خ(?:ْب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ))|ب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)انِ|\s*ٱلث(?:َ?ّ|َ?)انِ))))ي|خبار\s*ال[أا]يام\s*الثاني|َخ(?:ْب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني))|ب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني)))|خ(?:ْب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني))|ب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني)))|ل[أا]خبار\s*الثاني)|أَخ(?:ْب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني))|ب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني)))|أخْب(?:َار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني)|ار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني))|أخبَار(?:ِ\s*ٱلث(?:َ?ّ|َ?)اني|\s*ٱلث(?:َ?ّ|َ?)اني)|أخبارِ\s*ٱلث(?:َ?ّ|َ?)اني|أخبار\s*ٱلث(?:َ?ّ|َ?)اني|2[أا]خبار|2[أا]خ))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Chr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:ر(?:ِس(?:َالَ?ةُ|الَ?ةُ)|س(?:َالَ?ةُ|الَ?ةُ))|سفر|من|1)(?:\.\s*(?:[أا]خ(?:ب(?:ار\s*ال[أا]يام\s*ال[أا]ول|َار)|ْبَ?ار)|قص(?:ّة\s*النبيّ?\s*داود|ة\s*النبيّ?\s*داود)|[أا]خ(?:بار)?)|\s*(?:[أا]خ(?:ب(?:ار\s*ال[أا]يام\s*ال[أا]ول|َار)|ْبَ?ار)|قص(?:ّة\s*النبيّ?\s*داود|ة\s*النبيّ?\s*داود)|[أا]خ(?:بار)?))|ر(?:ِس(?:َالَ?ة\.|الَ?ة\.)|س(?:َالَ?ة\.|الَ?ة\.))\s*(?:[أا]خ(?:ب(?:ار\s*ال[أا]يام\s*ال[أا]ول|َار)|ْبَ?ار)|قص(?:ّة\s*النبيّ?\s*داود|ة\s*النبيّ?\s*داود)|[أا]خ(?:بار)?)|ر(?:ِس(?:َالَ?ة\s*|الَ?ة\s*)|س(?:َالَ?ة\s*|الَ?ة\s*))(?:[أا]خ(?:ب(?:ار\s*ال[أا]يام\s*ال[أا]ول|َار)|ْبَ?ار)|قص(?:ّة\s*النبيّ?\s*داود|ة\s*النبيّ?\s*داود)|[أا]خ(?:بار)?)|ال[أا]ولى(?:\.\s*(?:[أا]خ(?:ب(?:ار\s*ال[أا]يام\s*ال[أا]ول|َار)|ْبَ?ار)|قص(?:ّة\s*النبيّ?\s*داود|ة\s*النبيّ?\s*داود)|[أا]خ(?:بار)?)|\s*(?:[أا]خ(?:ب(?:ار\s*ال[أا]يام\s*ال[أا]ول|َار)|ْبَ?ار)|قص(?:ّة\s*النبيّ?\s*داود|ة\s*النبيّ?\s*داود)|[أا]خ(?:بار)?))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Chr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:ر(?:ِس(?:َالَ?ةُ|الَ?ةُ)|س(?:َالَ?ةُ|الَ?ةُ))|سفر|من|2)(?:\.\s*(?:[أا]خ(?:ب(?:ار\s*ال[أا]يام\s*الثاني|َار)|ْبَ?ار)|قص(?:ّة\s*النبيّ?\s*سليمان|ة\s*النبيّ?\s*سليمان)|[أا]خ(?:بار)?)|\s*(?:[أا]خ(?:ب(?:ار\s*ال[أا]يام\s*الثاني|َار)|ْبَ?ار)|قص(?:ّة\s*النبيّ?\s*سليمان|ة\s*النبيّ?\s*سليمان)|[أا]خ(?:بار)?))|ر(?:ِس(?:َالَ?ة\.|الَ?ة\.)|س(?:َالَ?ة\.|الَ?ة\.))\s*(?:[أا]خ(?:ب(?:ار\s*ال[أا]يام\s*الثاني|َار)|ْبَ?ار)|قص(?:ّة\s*النبيّ?\s*سليمان|ة\s*النبيّ?\s*سليمان)|[أا]خ(?:بار)?)|ر(?:ِس(?:َالَ?ة\s*|الَ?ة\s*)|س(?:َالَ?ة\s*|الَ?ة\s*))(?:[أا]خ(?:ب(?:ار\s*ال[أا]يام\s*الثاني|َار)|ْبَ?ار)|قص(?:ّة\s*النبيّ?\s*سليمان|ة\s*النبيّ?\s*سليمان)|[أا]خ(?:بار)?)|الثانية(?:\.\s*(?:[أا]خ(?:ب(?:ار\s*ال[أا]يام\s*الثاني|َار)|ْبَ?ار)|قص(?:ّة\s*النبيّ?\s*سليمان|ة\s*النبيّ?\s*سليمان)|[أا]خ(?:بار)?)|\s*(?:[أا]خ(?:ب(?:ار\s*ال[أا]يام\s*الثاني|َار)|ْبَ?ار)|قص(?:ّة\s*النبيّ?\s*سليمان|ة\s*النبيّ?\s*سليمان)|[أا]خ(?:بار)?))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ezra"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:سفر\s*عزرا|ع(?:َزْ?رَ|زْ?رَ)ا|ع(?:(?:َزْ?را|زْ?را)|ز)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Neh"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ن(?:َح(?:َمْ?يَ|مْ?يَ)|ح(?:َمْ?يَ|مْ?يَ))ا|سفر\s*نحميا|ن(?:(?:َح(?:َمْ?يا|مْ?يا)|ح(?:َمْ?يا|مْ?يا))|ح)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Esth"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:سفر\s*[أا]ستير|(?:[أا](?:َسْ?تِ|سْ?تِ)|إست)ير|[أا](?:َسْ?تي|سْ?تي)ر|(?:إ|[أا])س))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Job"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:قص(?:ّة\s*الن(?:ّبي(?:ّ\s*[أا]يّ?وب|\s*[أا]يّ?وب)|بي(?:ّ\s*[أا]يّ?وب|\s*[أا]يّ?وب))|ة\s*الن(?:ّبي(?:ّ\s*[أا]يّ?وب|\s*[أا]يّ?وب)|بي(?:ّ\s*[أا]يّ?وب|\s*[أا]يّ?وب)))|[أا](?:َي(?:ُ?ّ|ُ?)وبَ|(?:يُ?ّ|يُ?)وبَ)|سفر\s*[أا]يوب|[أا](?:َي(?:ُ?ّ|ُ?)وب|يُ?ّوب|يُ?وب|ي)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ps"],
            testament: "oa",
            testament_books: { Ps: "oa" },
            regexp: /(?:^|(?<=[^\p{L}]))((?:م(?:ز(?:امير\s*داود\s*النبيّ|مور)|ن\s*كتاب\s*الزبور)|مز(?:امير\s*داود\s*النبي)?|ا(?:َل(?:ْم(?:َز(?:َام(?:ِيرُ?|يرُ?)|ام(?:ِيرُ?|يرُ?))|ز(?:َام(?:ِيرُ?|يرُ?)|ام(?:ِيرُ?|يرُ?)))|م(?:َز(?:َام(?:ِيرُ?|يرُ?)|ام(?:ِيرُ?|يرُ?))|ز(?:َام(?:ِيرُ?|يرُ?)|ام(?:ِيرُ?|يرُ?))))|ل(?:ْم(?:َز(?:َام(?:ِيرُ?|يرُ?)|ام(?:ِيرُ?|يرُ?))|ز(?:َام(?:ِيرُ?|يرُ?)|ام(?:ِيرُ?|يرُ?)))|م(?:َز(?:َام(?:ِيرُ?|يرُ?)|ام(?:ِيرُ?|يرُ?))|ز(?:َام(?:ِيرُ?|يرُ?)|ام(?:ِيرُ?|يرُ?)))))|Mazmour))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Prov"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:من\s*[أا]مثال\s*النبيّ?\s*سليمان|سفر\s*ال[أا]مثال|أ(?:َم(?:ْثَ?الٌ|ثَ?الٌ)|م(?:ْثَ?الٌ|ثَ?الٌ))|ا(?:َم(?:ْثَ?الٌ|ثَ?الٌ)|م(?:ْثَ?الٌ|ثَ?الٌ))|ال[أا]مْ?ثَال|أ(?:َم(?:ْثَ?ال|ثَ?ال)|م(?:ْثَ?ال|(?:ثَ?ال)?))|ا(?:َم(?:ْثَ?ال|ثَ?ال)|م(?:ْثَ?ال|(?:ثَ?ال)?))|ال[أا]مْ?ثال))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Eccl"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:كتاب\s*الخطيب\s*الحكيم|ا(?:َل(?:ْج(?:َام(?:ِعَ?ةِ|عَ?ةِ)|ام(?:ِعَ?ةِ|عَ?ةِ))|ج(?:َام(?:ِعَ?ةِ|عَ?ةِ)|ام(?:ِعَ?ةِ|عَ?ةِ)))|ل(?:ْج(?:َام(?:ِعَ?ةِ|عَ?ةِ)|ام(?:ِعَ?ةِ|عَ?ةِ))|ج(?:َام(?:ِعَ?ةِ|عَ?ةِ)|ام(?:ِعَ?ةِ|عَ?ةِ))))|الخطيب\s*الحكيم|ا(?:َل(?:ْج(?:َام(?:ِعَ?ة|عَ?ة)|ام(?:ِعَ?ة|عَ?ة))|ج(?:َام(?:ِعَ?ة|عَ?ة)|ام(?:ِعَ?ة|عَ?ة)))|ل(?:ْج(?:َام(?:ِعَ?ة|عَ?ة)|ام(?:ِعَ?ة|عَ?ة))|ج(?:َام(?:ِعَ?ة|عَ?ة)|ام(?:ِعَ?ة|عَ?ة))))|سفر\s*الجامعة|جا))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Song"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ن(?:َش(?:ِيد(?:ُ\s*ٱلْأَنْشَادِ|\s*ال(?:انشَ?اد|أنشَ?اد))|يد\s*ال(?:انشَ?اد|أنشَ?اد))|ش(?:ِيد\s*ال(?:انشَ?اد|أنشَ?اد)|يد\s*(?:ال(?:ان(?:اشيد|شَ?اد)|أن(?:اشيد|شَ?اد))|ٱلانشاد))?)|سفر\s*نشيد\s*ال[أا]نشاد))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jer"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:من\s*الوحي\s*[إا]لى\s*[إا]رميا|[إا](?:ِر(?:ْمِ?يَ|مِ?يَ)|ر(?:ْمِ?يَ|مِ?يَ))ا|سفر\s*ارميا|[إا](?:ِر(?:ْمِ?يا|مِ?يا)|ر(?:ْمِ?يا|مِ?يا))|[إا]ر))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Ezek"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:من\s*الوحي\s*[إا]لى\s*حزقيال|ح(?:ِز(?:ْقِ?يَ|قِ?يَ)|ز(?:ْقِ?يَ|قِ?يَ))ال|سفر\s*حزقيال|ح(?:ِز(?:ْقِ?يا|قِ?يا)|ز(?:ْقِ?يا|قِ?يا))ل|حز))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Dan"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:كتاب\s*الن(?:ّبيّ?\s*دانيال|بيّ?\s*دانيال)|سفر\s*دانيال|د(?:َان(?:ِي[آا]|ي[آا])|ان(?:ِي[آا]|ي[آا]))ل|دَ?انيَال|دا))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Hos"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:من\s*الوحي\s*[إا]لى\s*هوشع|سفر\s*هوشع|هُ?وشَع|ه(?:ُ?وشع|و)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Joel"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:سفر\s*يو[ئي]يل|ي(?:ُو[ئي]ِ|و[ئي]ِ)يل|ي(?:ُو[ئي]ي|و[ئي]ي)ل|ي(?:و[ئي]?|ؤ)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Amos"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:من\s*الوحي\s*[إا]لى\s*عاموس|سفر\s*عاموس|عَ?امُوس|عَ?اموس|عا))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Obad"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:سفر\s*عوبـيديا|ع(?:ُوب(?:َدْ?يَ|دْ?يَ)|وب(?:َدْ?يَ|دْ?يَ))ا|ع(?:(?:ُوب(?:َدْ?يا|دْ?يا)|وب(?:َدْ?يا|دْ?يا))|و)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jonah"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:قص(?:ّة\s*الن(?:ّبيّ?\s*يونس|بيّ?\s*يونس)|ة\s*الن(?:ّبيّ?\s*يونس|بيّ?\s*يونس))|سفر\s*يونان|يُ?ونَان|يُ?ونان|يونس|يون))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Mic"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:من\s*الوحي\s*[إا]لى\s*ميخا|سفر\s*ميخا|مِ?يخَا|م(?:ِ?يخا|ي)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Nah"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:سفر\s*ناحوم|ن(?:َاحُ|احُ|ح)وم|نَ?احوم|نا))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Hab"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:من\s*الوحي\s*[إا]لى\s*حبقوق|ح(?:َب(?:َقُ?ّ|قُ?ّ)|ب(?:َقُ?ّ|قُ?ّ))وق|سفر\s*حبقوق|ح(?:َب(?:َقُ?و|قُ?و)|ب(?:َقُ?و|قُ?و))ق|حب))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Zeph"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ص(?:َف(?:َنْ?يَ|نْ?يَ)|ف(?:َنْ?يَ|نْ?يَ))ا|سفر\s*صفنيا|ص(?:(?:َف(?:َنْ?يا|نْ?يا)|ف(?:َنْ?يا|نْ?يا))|ف)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Hag"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:سفر\s*حجاي|ح(?:َجَ?ّ|ج(?:ّ?ا|َّ))ي|ح(?:(?:َجَ?ي|ج(?:ّ?ي|َي))|ج)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Zech"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:من\s*الوحي\s*[إا]لى\s*زكريّ?ا|ز(?:َك(?:َرِ?يَ|رِ?يَ)|ك(?:َرِ?يَ|رِ?يَ))ّ?ا|(?:ز(?:َك(?:َرِ?يّ|رِ?يّ)|ك(?:َرِ?يّ|رِ?يّ))|سفر\s*زكري)ا|ز(?:(?:َك(?:َرِ?يا|رِ?يا)|ك(?:َرِ?يا|رِ?يا))|ك)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Mal"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))((?:م(?:ن\s*الوحي\s*[إا]لى\s*ملاك|َلَ?اخِ|لَ?اخِ)ي|سفر\s*ملاخي|م(?:(?:َلَ?اخي|لَ?اخي)|لا)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Matt"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ا(?:لبشارة\s*كما\s*دوّ?نها\s*متى|(?:ِن(?:ْج(?:ِيل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ))|يل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ)))|ج(?:ِيل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ))|يل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ))))|ن(?:ْج(?:ِيل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ))|يل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ)))|ج(?:ِيل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ))|يل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ)))))ى|ِن(?:ْج(?:ِيل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى))|يل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى)))|ج(?:ِيل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى))|يل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى))))|ن(?:ْج(?:ِيل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى))|يل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى)))|ج(?:ِيل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى))|يل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى)))))|(?:(?:م(?:ن\s*ال[إا]نجيل\s*-\s*عن\s*مت|تَ)|مت)ّ|إِن(?:ْج(?:ِيل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ))|يل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ)))|ج(?:ِيل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ))|يل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ))))|إن(?:ْج(?:ِيل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ))|يل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ)))|ج(?:ِيل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ))|يل(?:ُ\s*م(?:َتَ?ّ|تَ?ّ)|\s*م(?:َتَ?ّ|تَ?ّ))))|مَتَ?ّ)ى|م(?:ن\s*ال[إا]نجيل\s*-\s*عن\s*مت|تَ)ى|إِن(?:ْج(?:ِيل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى))|يل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى)))|ج(?:ِيل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى))|يل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى))))|إن(?:ْج(?:ِيل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى))|يل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى)))|ج(?:ِيل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى))|يل(?:ُ\s*م(?:َتَ?ى|تَ?ى)|\s*م(?:َتَ?ى|تَ?ى))))|Matta|مَتَ?ى|متى|مت))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Mark"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ا(?:لبشارة\s*كما\s*دوّ?نها\s*مرقس|ِنجيل(?:ُ\s*م(?:َرقُ?سَ|رقُ?سَ)|\s*م(?:َرقُ?سَ|رقُ?سَ))|ِنجيل(?:ُ\s*م(?:َرقُ?س|رقُ?س)|\s*م(?:َرقُ?س|رقُ?س))|نجيل(?:ُ\s*م(?:َرقُ?سَ|رقُ?سَ)|\s*م(?:َرقُ?سَ|رقُ?سَ))|نجيل(?:ُ\s*م(?:َرقُ?س|رقُ?س)|\s*م(?:َرقُ?س|رقُ?س)))|إِنْجِيلُ\s*مَرْقُسَ|إِنجيل(?:ُ\s*م(?:َرقُ?سَ|رقُ?سَ)|\s*م(?:َرقُ?سَ|رقُ?سَ))|إِنجيل(?:ُ\s*م(?:َرقُ?س|رقُ?س)|\s*م(?:َرقُ?س|رقُ?س))|إنجيل(?:ُ\s*م(?:َرقُ?سَ|رقُ?سَ)|\s*م(?:َرقُ?سَ|رقُ?سَ))|إنجيل(?:ُ\s*م(?:َرقُ?س|رقُ?س)|\s*م(?:َرقُ?س|رقُ?س))|مَ?رْقُ?سَ|مَ?رْقُ?س|مَ?رقُ?سَ|مَ?رقُ?س|Mercos|مر))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Luke"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ا(?:لبشارة\s*كما\s*دوّ?نها\s*لوقا|(?:ِن(?:ْج(?:ِيل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ)|يل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ))|ج(?:ِيل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ)|يل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ)))|ن(?:ْج(?:ِيل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ)|يل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ))|ج(?:ِيل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ)|يل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ))))ا|ِن(?:ْج(?:ِيل(?:ُ\s*لُ?وقا|\s*لُ?وقا)|يل(?:ُ\s*لُ?وقا|\s*لُ?وقا))|ج(?:ِيل(?:ُ\s*لُ?وقا|\s*لُ?وقا)|يل(?:ُ\s*لُ?وقا|\s*لُ?وقا)))|ن(?:ْج(?:ِيل(?:ُ\s*لُ?وقا|\s*لُ?وقا)|يل(?:ُ\s*لُ?وقا|\s*لُ?وقا))|ج(?:ِيل(?:ُ\s*لُ?وقا|\s*لُ?وقا)|يل(?:ُ\s*لُ?وقا|\s*لُ?وقا))))|(?:إِن(?:ْج(?:ِيل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ)|يل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ))|ج(?:ِيل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ)|يل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ)))|إن(?:ْج(?:ِيل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ)|يل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ))|ج(?:ِيل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ)|يل(?:ُ\s*لُ?وقَ|\s*لُ?وقَ)))|لُ?وقَ)ا|إِن(?:ْج(?:ِيل(?:ُ\s*لُ?وقا|\s*لُ?وقا)|يل(?:ُ\s*لُ?وقا|\s*لُ?وقا))|ج(?:ِيل(?:ُ\s*لُ?وقا|\s*لُ?وقا)|يل(?:ُ\s*لُ?وقا|\s*لُ?وقا)))|إن(?:ْج(?:ِيل(?:ُ\s*لُ?وقا|\s*لُ?وقا)|يل(?:ُ\s*لُ?وقا|\s*لُ?وقا))|ج(?:ِيل(?:ُ\s*لُ?وقا|\s*لُ?وقا)|يل(?:ُ\s*لُ?وقا|\s*لُ?وقا)))|Lou2a|لُوقا|لوقا|لو))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ي(?:ُوح(?:َن(?:َ?ّا\s*ٱل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى))|َ?ا\s*ٱل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى)))|ن(?:َ?ّا\s*ٱل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى))|َ?ا\s*ٱل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى))))|وحَ?نَّا\s*ٱل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى))|وح(?:َنّ?ا\s*ٱ|نّ?ا\s*ٱ)ل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى))|وحَ?نَا\s*ٱل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى))|وح(?:َن(?:ّا\s*ال[أا]|ا\s*ال[أا])|ن(?:ّا\s*ال[أا]|ا\s*ال[أا]))ولَ?ى)|1يو(?:حنا)?))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ي(?:ُوحَنَّا\s*ٱلثَّانِيَةُ|وح(?:(?:َن(?:ّا\s*الثّ?انيةُ|ا\s*الثّ?انيةُ)|ن(?:ّا\s*الثّ?انيةُ|ا\s*(?:الثّ?انيةُ|ٱلثانية)))|(?:َن(?:ّا\s*الثّ?انية|ا\s*الثّ?انية)|ن(?:ّا\s*الثّ?انية|ا\s*الثّ?انية))))|2يو(?:حنا)?))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["3John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ر(?:ِسَالَةُ\s*القِدِّيس\s*يُوحَنَّا\s*الثَّالِثَ|سالة\s*(?:القديس\s*)?يوحنا\s*الثالث)ة|ي(?:ُوحَنَّا\s*ٱلثَّالِثَةُ|وح(?:َن(?:ّا\s*الث(?:ّال(?:ِثَ?ةُ|ثَ?ةُ)|ال(?:ِثَ?ةُ|ثَ?ةُ))|ا\s*الث(?:ّال(?:ِثَ?ةُ|ثَ?ةُ)|ال(?:ِثَ?ةُ|ثَ?ةُ)))|ن(?:ّا\s*الث(?:ّال(?:ِثَ?ةُ|ثَ?ةُ)|ال(?:ِثَ?ةُ|ثَ?ةُ))|ا\s*الث(?:ّال(?:ِثَ?ةُ|ثَ?ةُ)|ال(?:ِثَ?ةُ|ثَ?ةُ)))))|يوح(?:َن(?:ّا\s*الث(?:ّال(?:ِثَ?ة|ثَ?ة)|ال(?:ِثَ?ة|ثَ?ة))|ا\s*الث(?:ّال(?:ِثَ?ة|ثَ?ة)|ال(?:ِثَ?ة|ثَ?ة)))|ن(?:ّا\s*الث(?:ّال(?:ِثَ?ة|ثَ?ة)|ال(?:ِثَ?ة|ثَ?ة))|ا\s*الث(?:ّال(?:ِثَ?ة|ثَ?ة)|ال(?:ِثَ?ة|ثَ?ة))))|يوحنا\s*ٱلثالثة|3(?:\s*(?:ي(?:ُوح(?:َن(?:َ?ّ|َ?)ا|ن(?:َ?ّ|َ?)ا)|وح(?:َن(?:َ?ّ|َ?)ا|ن(?:َ?ّ|َ?)ا))|You7anna)|يوحنا)|3\s*?يو))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:رِسَالَةُ\.?\s*القِدِّيسِ\s*يُوحَنَّا\s*الأولَ|(?:رسالة\.?\s*القِ|(?:(?:سفر|(?:من|1))\.|(?:سفر|(?:من|1)))\s*القِ)دِّيسِ\s*يُوحَنَّا\s*الأولَ)ى|ال(?:أولى\.?\s*القِدِّيسِ\s*يُوحَنَّا\s*الأولَى|اولى(?:\.\s*(?:القديس\s*يوحنا\s*الاولى|يوحن(?:ّا\s*ال[أا]|ا\s*ال[أا])ولى|ي(?:ُوح(?:َن(?:َ?ّ|َ?)ا|ن(?:َ?ّ|َ?)ا)|وحَن(?:َ?ّ|َ?)ا|وحنَّ?ا)|You7anna|يو(?:حنّ?ا)?)|\s*(?:القديس\s*يوحنا\s*الاولى|يوحن(?:ّا\s*ال[أا]|ا\s*ال[أا])ولى|ي(?:ُوح(?:َن(?:َ?ّ|َ?)ا|ن(?:َ?ّ|َ?)ا)|وحَن(?:َ?ّ|َ?)ا|وحنَّ?ا)|You7anna|يو(?:حنّ?ا)?))|أولى\.?\s*يوحن(?:ّا\s*ال[أا]|ا\s*ال[أا])ولى|أولى\.?\s*ي(?:ُوح(?:َن(?:َ?ّ|َ?)ا|ن(?:َ?ّ|َ?)ا)|وحَن(?:َ?ّ|َ?)ا|وحنَّ?ا)|أولى\.?\s*You7anna|أولى\.?\s*يو(?:حنّ?ا)?)|(?:رسالة\.?\s*القد|(?:(?:سفر|(?:من|1))\.|(?:سفر|(?:من|1)))\s*القد)يس\s*يوحنا\s*الاولى|(?:رِسَالَةُ\.?\s*ي|ر(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*ي|ِس(?:(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)ي|َال(?:(?:ةُ?\.\s*|ةُ?\s*)ي|َة\.?\s*ي))|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*)ي|سالة\.?\s*ي)|(?:(?:سفر|(?:من|1))\.|(?:سفر|(?:من|1)))\s*ي)وحن(?:ّا\s*ال[أا]|ا\s*ال[أا])ولى|(?:رِسَالَةُ\.?\s*ي|ر(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*ي|ِس(?:(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)ي|َال(?:(?:ةُ?\.\s*|ةُ?\s*)ي|َة\.?\s*ي))|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*)ي|سالة\.?\s*ي)|(?:(?:سفر|(?:من|1))\.|(?:سفر|(?:من|1)))\s*ي)(?:ُوح(?:َن(?:َ?ّ|َ?)ا|ن(?:َ?ّ|َ?)ا)|وحَن(?:َ?ّ|َ?)ا|وحنَّ?ا)|(?:رِسَالَةُ\.?\s*Y|ر(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*Y|ِس(?:(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)Y|َال(?:(?:ةُ?\.\s*|ةُ?\s*)Y|َة\.?\s*Y))|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*)Y|سالة\.?\s*Y)|(?:(?:سفر|(?:من|1))\.|(?:سفر|(?:من|1)))\s*Y)ou7anna|(?:رِسَالَةُ\.?\s*ي|ر(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*ي|ِس(?:(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)ي|َال(?:(?:ةُ?\.\s*|ةُ?\s*)ي|َة\.?\s*ي))|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*)ي|سالة\.?\s*ي)|(?:(?:سفر|(?:من|1))\.|(?:سفر|(?:من|1)))\s*ي)و(?:حنّ?ا)?))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:رِسَالَةُ\.?\s*القِدِّيس\s*يُوحَنَّا\s*الثَّانِيَة|الثانية(?:\.\s*(?:الق(?:ِدِّيس\s*يُوحَنَّا\s*الثَّانِيَ|ديس\s*يوحنا\s*الثاني)ة|يوحنا\s*الثانية|ي(?:ُوح(?:َن(?:َ?ّ|َ?)ا|ن(?:َ?ّ|َ?)ا)|وحَن(?:َ?ّ|َ?)ا|(?:وحنَ?ّ|وحنَ)ا)|You7anna|يو(?:حنا)?)|\s*(?:الق(?:ِدِّيس\s*يُوحَنَّا\s*الثَّانِيَ|ديس\s*يوحنا\s*الثاني)ة|يوحنا\s*الثانية|ي(?:ُوح(?:َن(?:َ?ّ|َ?)ا|ن(?:َ?ّ|َ?)ا)|وحَن(?:َ?ّ|َ?)ا|(?:وحنَ?ّ|وحنَ)ا)|You7anna|يو(?:حنا)?))|رسالة\.\s*(?:الق(?:ِدِّيس\s*يُوحَنَّا\s*الثَّانِيَ|ديس\s*يوحنا\s*الثاني)ة|يوحنا\s*الثانية|ي(?:ُوح(?:َن(?:َ?ّ|َ?)ا|ن(?:َ?ّ|َ?)ا)|وحَن(?:َ?ّ|َ?)ا|(?:وحنَ?ّ|وحنَ)ا)|You7anna|يو(?:حنا)?)|رسالة\s*(?:الق(?:ِدِّيس\s*يُوحَنَّا\s*الثَّانِيَ|ديس\s*يوحنا\s*الثاني)ة|يوحنا\s*الثانية|ي(?:ُوح(?:َن(?:َ?ّ|َ?)ا|ن(?:َ?ّ|َ?)ا)|وحَن(?:َ?ّ|َ?)ا|(?:وحنَ?ّ|وحنَ)ا)|You7anna|يو(?:حنا)?)|(?:سفر|من|2)(?:\.\s*(?:الق(?:ِدِّيس\s*يُوحَنَّا\s*الثَّانِيَ|ديس\s*يوحنا\s*الثاني)ة|يوحنا\s*الثانية|ي(?:ُوح(?:َن(?:َ?ّ|َ?)ا|ن(?:َ?ّ|َ?)ا)|وحَن(?:َ?ّ|َ?)ا|(?:وحنَ?ّ|وحنَ)ا)|You7anna|يو(?:حنا)?)|\s*(?:الق(?:ِدِّيس\s*يُوحَنَّا\s*الثَّانِيَ|ديس\s*يوحنا\s*الثاني)ة|يوحنا\s*الثانية|ي(?:ُوح(?:َن(?:َ?ّ|َ?)ا|ن(?:َ?ّ|َ?)ا)|وحَن(?:َ?ّ|َ?)ا|(?:وحنَ?ّ|وحنَ)ا)|You7anna|يو(?:حنا)?))|ر(?:ِس(?:َال(?:َة(?:ُ\.?\s*ي|\.?\s*ي)|(?:ةُ?\.\s*|ةُ?\s*)ي)|(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)ي)|(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*))ي)وحنا\s*الثانية|ر(?:ِس(?:َال(?:َة(?:ُ\.?\s*ي|\.?\s*ي)|(?:ةُ?\.\s*|ةُ?\s*)ي)|(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)ي)|(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*))ي)(?:ُوح(?:َن(?:َ?ّ|َ?)ا|ن(?:َ?ّ|َ?)ا)|وحَن(?:َ?ّ|َ?)ا|(?:وحنَ?ّ|وحنَ)ا)|ر(?:ِس(?:َال(?:َة(?:ُ\.?\s*Y|\.?\s*Y)|(?:ةُ?\.\s*|ةُ?\s*)Y)|(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)Y)|(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*))Y)ou7anna|ر(?:ِس(?:َال(?:َة(?:ُ\.?\s*ي|\.?\s*ي)|(?:ةُ?\.\s*|ةُ?\s*)ي)|(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)ي)|(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*))ي)و(?:حنا)?))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["John"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ا(?:لبشارة\s*كما\s*دوّ?نها\s*يوحنا|(?:ِنجيل(?:ُ\s*يوحَ?نّ|\s*يوحَ?نّ)|نجيل(?:ُ\s*يوحَ?نّ|\s*يوحَ?نّ))ا|ِنجيل(?:ُ\s*يوحَ?نا|\s*يوحَ?نا)|نجيل(?:ُ\s*يوحَ?نا|\s*يوحَ?نا))|(?:إِنْجِيلُ\s*يُوحَنَّ|إِنجيل(?:ُ\s*يوحَ?نّ|\s*يوحَ?نّ)|إنجيل(?:ُ\s*يوحَ?نّ|\s*يوحَ?نّ)|ي(?:ُوحَ?نَ|وحَ?نَ)ّ|ي(?:ُوحَ?نّ|وحَ?نّ))ا|إِنجيل(?:ُ\s*يوحَ?نا|\s*يوحَ?نا)|إنجيل(?:ُ\s*يوحَ?نا|\s*يوحَ?نا)|You7anna|ي(?:ُوحَ?نَ|وحَ?نَ)ا|ي(?:ُوحَ?نا|وحَ?نا)|يو))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Acts"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:أ(?:(?:(?:(?:َعْمَالُ\s*ٱلرُّسُلِ|عمال\s*الر(?:ُ?ّسُ?لِ|ُ?سُ?لِ))|عمالُ\s*الر(?:ُ?ّسُ?لِ|ُ?سُ?لِ))|عمَال)|عْمَ?ال)|اع(?:م(?:ال(?:(?:ُ\s*الر(?:ُ?ّسُ?لِ|ُ?سُ?لِ)|\s*الر(?:ُ?ّسُ?لِ|ُ?سُ?لِ))|\s*ٱلرسل)|َال)|ْمَ?ال)|أع(?:مالُ\s*الر(?:ُ?ّسُ?ل|ُ?سُ?ل)|(?:مال\s*الر(?:ُ?ّسُ?ل|ُ?سُ?ل)|(?:مال)?))|اع(?:مال(?:ُ\s*الر(?:ُ?ّسُ?ل|ُ?سُ?ل)|\s*الر(?:ُ?ّسُ?ل|ُ?سُ?ل))?)?|سيرة\s*الحواريّ?ين|A3mel\s*el-rousl))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Rom"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:الر(?:ِسَالَةُ\s*إِلَى\s*أَهْلِ\s*رُومِيَةَ|سالة\s*الى\s*اهل\s*رومية)|من\s*رسالة\s*روما|رسالة\s*رومة|ر(?:ُوم(?:ِيَ?ةَ|يَ?ةَ|ا)|وم(?:ِيَ?ةَ|(?:يَ?ةَ|[اة])))|ر(?:ُوم(?:ِيَ?ة|يَ?ة)|و(?:مِيَ?ة|(?:ميَ?ة)?))|رُ?ومَا|Roma))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Cor"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:الر(?:ِّسَالَة\s*الأُولى\s*إلى\s*أهلِ\s*كُورَنثُ|سالة\s*الاولى\s*الى\s*اهل\s*كورنث)وس|ك(?:ُور(?:ِن(?:ْث(?:ُوس(?:َ\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))|وس(?:َ\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)))|ث(?:ُوس(?:َ\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))|وس(?:َ\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))))|ن(?:ْث(?:ُوس(?:َ\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))|وس(?:َ\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)))|ث(?:ُوس(?:َ\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))|وس(?:َ\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)))))|ورِ?نْث(?:ُوس(?:َ\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))|وس(?:َ\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)))|ورِ?نثُوس(?:َ\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))|ور(?:ِنثوسَ?\s*ٱ|نثوسَ?\s*ٱ)ل[أا](?:ُولَ?ى|ولَ?ى)|ور(?:ِنثوس(?:َ\s*ال[أا]|\s*ال[أا])|نثوس(?:َ\s*ال[أا]|\s*ال[أا]))ولَ?ى|ورنتوس\s*ال[أا]ولى)|1كورنتوس|1كور?))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Cor"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:ر(?:ِس(?:َالَ?ةُ|الَ?ةُ)|س(?:َالَ?ةُ|الَ?ةُ))|سفر|من|2)(?:\.\s*(?:رسالة\s*كورنتوس\s*الثانية|كورنثوس\s*الثانية|[إا]لى\s*قورنتس|Korentos|كو(?:رنثوس)?)|\s*(?:رسالة\s*كورنتوس\s*الثانية|كورنثوس\s*الثانية|[إا]لى\s*قورنتس|Korentos|كو(?:رنثوس)?))|ر(?:ِس(?:َالَ?ة\.|الَ?ة\.)|س(?:َالَ?ة\.|الَ?ة\.))\s*(?:رسالة\s*كورنتوس\s*الثانية|كورنثوس\s*الثانية|[إا]لى\s*قورنتس|Korentos|كو(?:رنثوس)?)|ر(?:ِس(?:َالَ?ة\s*|الَ?ة\s*)|س(?:َالَ?ة\s*|الَ?ة\s*))(?:رسالة\s*كورنتوس\s*الثانية|كورنثوس\s*الثانية|[إا]لى\s*قورنتس|Korentos|كو(?:رنثوس)?)|الثانية(?:\.\s*(?:رسالة\s*كورنتوس\s*الثانية|كورنثوس\s*الثانية|[إا]لى\s*قورنتس|Korentos|كو(?:رنثوس)?)|\s*(?:رسالة\s*كورنتوس\s*الثانية|كورنثوس\s*الثانية|[إا]لى\s*قورنتس|Korentos|كو(?:رنثوس)?))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Cor"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:الر(?:ِّسَالَة\s*الثّانِيَة\s*إلى\s*أهلِ\s*كُورَنْثُ|سالة\s*الثانية\s*الى\s*اهل\s*كورنث)وس|ك(?:ُورِنْثُوسَ\s*ٱلثَّانِيةُ|ور(?:ِنثوس(?:َ\s*الثّ?انيةُ|\s*الثّ?انيةُ)|ن(?:ثوسَ\s*الثّ?انيةُ|(?:ثوس\s*الثّ?انيةُ|(?:توس\s*ا|ثوس\s*ٱ)لثانية))))|كور(?:ِنثوس(?:َ\s*الثّ?انية|\s*الثّ?انية)|نثوس(?:َ\s*الثّ?انية|\s*الثّ?انية))|2كورنتوس|2كور?))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Cor"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:ر(?:ِس(?:َالَ?ةُ|الَ?ةُ)|س(?:َالَ?ةُ|الَ?ةُ))|سفر|من|1)(?:\.\s*(?:رسالة\s*كورنتوس\s*ال[أا]ولى|كورنثوس\s*ال[أا]ولى|[إا]لى\s*قورنتس|Korentos|كو(?:رنثوس)?)|\s*(?:رسالة\s*كورنتوس\s*ال[أا]ولى|كورنثوس\s*ال[أا]ولى|[إا]لى\s*قورنتس|Korentos|كو(?:رنثوس)?))|ر(?:ِس(?:َالَ?ة\.|الَ?ة\.)|س(?:َالَ?ة\.|الَ?ة\.))\s*(?:رسالة\s*كورنتوس\s*ال[أا]ولى|كورنثوس\s*ال[أا]ولى|[إا]لى\s*قورنتس|Korentos|كو(?:رنثوس)?)|ر(?:ِس(?:َالَ?ة\s*|الَ?ة\s*)|س(?:َالَ?ة\s*|الَ?ة\s*))(?:رسالة\s*كورنتوس\s*ال[أا]ولى|كورنثوس\s*ال[أا]ولى|[إا]لى\s*قورنتس|Korentos|كو(?:رنثوس)?)|ال[أا]ولى(?:\.\s*(?:رسالة\s*كورنتوس\s*ال[أا]ولى|كورنثوس\s*ال[أا]ولى|[إا]لى\s*قورنتس|Korentos|كو(?:رنثوس)?)|\s*(?:رسالة\s*كورنتوس\s*ال[أا]ولى|كورنثوس\s*ال[أا]ولى|[إا]لى\s*قورنتس|Korentos|كو(?:رنثوس)?))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Col"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:الر(?:ِّسَالة\s*إلى\s*أهلِ\s*كُولُسِّ|سالة\s*الى\s*اهل\s*كولس)ي|(?:رسالة\s*كولوس|ك(?:ُول(?:ُوسِ?ّ|وسِ?ّ)|ول(?:ُوسِ?ّ|وسِ?ّ))|قولس)ي|ك(?:ُول(?:ُوسِ?ي|وسِ?ي)|ول(?:ُوسِ?ي|وسِ?ي))|Colossi|كو))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Gal"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:الر(?:ِّسَالةُ\s*إلى\s*أهْلِ\s*غَلاطِيَ|سالة\s*الى\s*اهل\s*غلاطي)ة|(?:من\s*)?رسالة\s*غلاطية|غ(?:َل(?:َاط(?:ِي(?:َ?ّ|َ?)ةَ|ي(?:َ?ّ|َ?)ةَ)|اط(?:ِي(?:َ?ّ|َ?)ةَ|ي(?:َ?ّ|َ?)ةَ))|ل(?:َاط(?:ِي(?:َ?ّ|َ?)ةَ|ي(?:َ?ّ|َ?)ةَ)|اط(?:ِي(?:َ?ّ|َ?)ةَ|ي(?:َ?ّ|َ?)ةَ)))|غ(?:َل(?:َاط(?:ِي(?:َ?ّ|َ?)ة|ي(?:َ?ّ|َ?)ة)|اط(?:ِي(?:َ?ّ|َ?)ة|ي(?:َ?ّ|َ?)ة))|ل(?:َاط(?:ِي(?:َ?ّ|َ?)ة|ي(?:َ?ّ|َ?)ة)|(?:اط(?:ِي(?:َ?ّ|َ?)ة|ي(?:َ?ّ|َ?)ة)|ا?)))|Ghalatya))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Eph"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ا(?:لرِّسَالةُ\s*إلى\s*أهْلِ\s*أفَسُسْ|َف(?:َسُ?سَ|سُ?سَ)|ف(?:َسُ?سَ|(?:سُ?سَ|اسس)))|(?:الرسالة\s*الى\s*اهل\s*افس|رسالة\s*[أا]فس|[أا]فاسو)س|من\s*رسالة\s*[أا]فاسوس|أ(?:َف(?:َسُ?سَ|سُ?سَ)|ف(?:َسُ?سَ|(?:سُ?سَ|اسس)))|أ(?:َف(?:َسُ?س|سُ?س)|ف(?:َسُ?س|(?:سُ?س)?))|ا(?:َف(?:َسُ?س|سُ?س)|ف(?:َسُ?س|(?:سُ?س)?))|Afasos))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Phil"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:الر(?:ِّسَالة\s*إلى\s*أهلِ\s*فِيلِيبِّ|سالة\s*الى\s*اهل\s*فيليب)ي|(?:رسالة\s*فيلبــ|ف(?:ِيل(?:ِبِ?ّ|بِ?ّ)|يل(?:ِبِ?ّ|(?:يبّ|بِ?ّ))))ي|ف(?:ِيل(?:ِبِ?ي|بِ?ي)|يل(?:ِبِ?ي|(?:يبي|بِ?ي)))|Filippi|في))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Thess"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:ر(?:ِس(?:َالَ?ةُ|الَ?ةُ)|س(?:َالَ?ةُ|الَ?ةُ))|سفر|من|1)(?:\.\s*(?:تسالونيكي\s*ال[أا]ولى|[إا]لى\s*تسالونيقي|Tasalouniki|تسَالونيكي|تس(?:الونيكي)?)|\s*(?:تسالونيكي\s*ال[أا]ولى|[إا]لى\s*تسالونيقي|Tasalouniki|تسَالونيكي|تس(?:الونيكي)?))|ر(?:ِس(?:َالَ?ة\.|الَ?ة\.)|س(?:َالَ?ة\.|الَ?ة\.))\s*(?:تسالونيكي\s*ال[أا]ولى|[إا]لى\s*تسالونيقي|Tasalouniki|تسَالونيكي|تس(?:الونيكي)?)|ر(?:ِس(?:َالَ?ة\s*|الَ?ة\s*)|س(?:َالَ?ة\s*|الَ?ة\s*))(?:تسالونيكي\s*ال[أا]ولى|[إا]لى\s*تسالونيقي|Tasalouniki|تسَالونيكي|تس(?:الونيكي)?)|ال[أا]ولى(?:\.\s*(?:تسالونيكي\s*ال[أا]ولى|[إا]لى\s*تسالونيقي|Tasalouniki|تسَالونيكي|تس(?:الونيكي)?)|\s*(?:تسالونيكي\s*ال[أا]ولى|[إا]لى\s*تسالونيقي|Tasalouniki|تسَالونيكي|تس(?:الونيكي)?))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Thess"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:الر(?:ِّسَالةُ\s*الأُولى\s*إلى\s*أهْلِ\s*تَسَالُونِيكِ|سالة\s*الاولى\s*الى\s*اهل\s*تسالونيك)ي|ت(?:َس(?:َال(?:ُون(?:ِيك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))|يك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)))|ون(?:ِيك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))|يك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))))|ال(?:ُون(?:ِيك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))|يك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)))|ون(?:ِيك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))|يك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)))))|سَال(?:ُون(?:ِيك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))|يك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)))|ون(?:ِيك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))|يك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))))|سالُون(?:ِيك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))|يك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)))|سالونِيك(?:ِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|ي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى))|سالونيكِي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|سالونيكي\s*ٱل[أا](?:ُولَ?ى|ولَ?ى)|سالونيكي\s*ال[أا]ولَ?ى|سالونكي\s*ال[أا]ولى)|1تسالونكي|1تس))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Thess"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:ر(?:ِس(?:َالَ?ةُ|الَ?ةُ)|س(?:َالَ?ةُ|الَ?ةُ))|سفر|من|2)(?:\.\s*(?:تسالونيكي\s*الثانية|[إا]لى\s*تسالونيقي|Tasalouniki|تسَالونيكي|تس(?:الونيكي)?)|\s*(?:تسالونيكي\s*الثانية|[إا]لى\s*تسالونيقي|Tasalouniki|تسَالونيكي|تس(?:الونيكي)?))|ر(?:ِس(?:َالَ?ة\.|الَ?ة\.)|س(?:َالَ?ة\.|الَ?ة\.))\s*(?:تسالونيكي\s*الثانية|[إا]لى\s*تسالونيقي|Tasalouniki|تسَالونيكي|تس(?:الونيكي)?)|ر(?:ِس(?:َالَ?ة\s*|الَ?ة\s*)|س(?:َالَ?ة\s*|الَ?ة\s*))(?:تسالونيكي\s*الثانية|[إا]لى\s*تسالونيقي|Tasalouniki|تسَالونيكي|تس(?:الونيكي)?)|الثانية(?:\.\s*(?:تسالونيكي\s*الثانية|[إا]لى\s*تسالونيقي|Tasalouniki|تسَالونيكي|تس(?:الونيكي)?)|\s*(?:تسالونيكي\s*الثانية|[إا]لى\s*تسالونيقي|Tasalouniki|تسَالونيكي|تس(?:الونيكي)?))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Thess"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:الر(?:ِّسَالة\s*الثَّانِيَة\s*إلى\s*أهْلِ\s*تَسَالُونِيكِ|سالة\s*الثانية\s*الى\s*اهل\s*تسالونيك)ي|ت(?:َسَالُونِيكِي\s*ٱلثَّانِيةُ|سالون(?:يكي\s*(?:الثّ?انيةُ|ٱلثانية)|كي\s*الثانية))|تسالونيكي\s*الثّ?انية|2تسالونكي|2تس))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Tim"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:ر(?:ِس(?:َالَ?ةُ|الَ?ةُ)|س(?:َالَ?ةُ|الَ?ةُ))|سفر|من|1)(?:\.\s*(?:بولس\s*ال[أا]ولى\s*[إا]لى\s*تيموثاوس|(?:[إا]لى\s*طيموت|تيموثَ)اوس|Timothawos|تيموثاوس|تي)|\s*(?:بولس\s*ال[أا]ولى\s*[إا]لى\s*تيموثاوس|(?:[إا]لى\s*طيموت|تيموثَ)اوس|Timothawos|تيموثاوس|تي))|ر(?:ِس(?:َالَ?ة\.|الَ?ة\.)|س(?:َالَ?ة\.|الَ?ة\.))\s*(?:بولس\s*ال[أا]ولى\s*[إا]لى\s*تيموثاوس|(?:[إا]لى\s*طيموت|تيموثَ)اوس|Timothawos|تيموثاوس|تي)|ر(?:ِس(?:َالَ?ة\s*|الَ?ة\s*)|س(?:َالَ?ة\s*|الَ?ة\s*))(?:بولس\s*ال[أا]ولى\s*[إا]لى\s*تيموثاوس|(?:[إا]لى\s*طيموت|تيموثَ)اوس|Timothawos|تيموثاوس|تي)|ال[أا]ولى(?:\.\s*(?:بولس\s*ال[أا]ولى\s*[إا]لى\s*تيموثاوس|(?:[إا]لى\s*طيموت|تيموثَ)اوس|Timothawos|تيموثاوس|تي)|\s*(?:بولس\s*ال[أا]ولى\s*[إا]لى\s*تيموثاوس|(?:[إا]لى\s*طيموت|تيموثَ)اوس|Timothawos|تيموثاوس|تي))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Tim"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:الر(?:ِّسَالَةُ\s*الأولى\s*إلى\s*تِيمُوثَ|سالة\s*الاولى\s*الى\s*تيموث)اوس|ت(?:ِيمُوثَاوُسَ\s*ٱلْأُولَى|يمو(?:ثاو(?:ُس(?:َ\s*ال[أا]ولَ|\s*ال[أا]ولَ)|س(?:َ\s*ال[أا]ولَ|\s*(?:ال[أا]ولَ|ٱلاول)))|تاوي\s*ال[أا]ول)ى|يموثاو(?:ُس(?:َ\s*ال[أا]ولى|\s*ال[أا]ولى)|س(?:َ\s*ال[أا]ولى|\s*ال[أا]ولى)))|1ت(?:يموثي|م)|1تي))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Tim"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:ر(?:ِس(?:َالَ?ةُ|الَ?ةُ)|س(?:َالَ?ةُ|الَ?ةُ))|سفر|من|2)(?:\.\s*(?:بولس\s*الثانية\s*[إا]لى\s*تيموثاوس|(?:[إا]لى\s*طيموت|تيموثَ)اوس|Timothawos|تيموثاوس|تي)|\s*(?:بولس\s*الثانية\s*[إا]لى\s*تيموثاوس|(?:[إا]لى\s*طيموت|تيموثَ)اوس|Timothawos|تيموثاوس|تي))|ر(?:ِس(?:َالَ?ة\.|الَ?ة\.)|س(?:َالَ?ة\.|الَ?ة\.))\s*(?:بولس\s*الثانية\s*[إا]لى\s*تيموثاوس|(?:[إا]لى\s*طيموت|تيموثَ)اوس|Timothawos|تيموثاوس|تي)|ر(?:ِس(?:َالَ?ة\s*|الَ?ة\s*)|س(?:َالَ?ة\s*|الَ?ة\s*))(?:بولس\s*الثانية\s*[إا]لى\s*تيموثاوس|(?:[إا]لى\s*طيموت|تيموثَ)اوس|Timothawos|تيموثاوس|تي)|الثانية(?:\.\s*(?:بولس\s*الثانية\s*[إا]لى\s*تيموثاوس|(?:[إا]لى\s*طيموت|تيموثَ)اوس|Timothawos|تيموثاوس|تي)|\s*(?:بولس\s*الثانية\s*[إا]لى\s*تيموثاوس|(?:[إا]لى\s*طيموت|تيموثَ)اوس|Timothawos|تيموثاوس|تي))))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Tim"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:الر(?:ِّسَالَةُ\s*الثَّانِية\s*إلى\s*تِيمُوثَ|سالة\s*الثانية\s*الى\s*تيموث)اوس|ت(?:ِيمُوثَاوُسَ\s*ٱلثَّانِيةُ|يمو(?:ثاو(?:ُس(?:َ\s*الثّ?انيةُ|\s*الثّ?انيةُ)|س(?:َ\s*الثّ?انيةُ|\s*(?:الثّ?انيةُ|ٱلثانية)))|تاوي\s*الثانية))|تيموثاو(?:ُس(?:َ\s*الثّ?انية|\s*الثّ?انية)|س(?:َ\s*الثّ?انية|\s*الثّ?انية))|2ت(?:يموثي|م)|2تي))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Titus"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:(?:الر(?:ِ?ّس(?:َالة\s*[إا]لى\s*تِ?يطُ|الة\s*[إا]لى\s*تِ?يطُ)|ِ?س(?:َالة\s*[إا]لى\s*تِ?يطُ|الة\s*[إا]لى\s*تِ?يطُ))|تيتو)س|الر(?:ِ?ّس(?:َالة\s*[إا]لى\s*تِ?يطس|الة\s*[إا]لى\s*تِ?يطس)|ِ?س(?:َالة\s*[إا]لى\s*تِ?يطس|الة\s*[إا]لى\s*تِ?يطس))|رسالة\s*بولس\s*[إا]لى\s*تيطس|ت(?:ِيطُ?سَ|يطُ?سَ)|ت(?:ِيطُ?س|ي(?:طُ?س)?)|Titos|طيطس))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Phlm"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:الر(?:ِ?ّس(?:َالة\s*[إا]لى\s*ف(?:ِيلِ?يمُ|يلِ?يمُ)|الة\s*[إا]لى\s*ف(?:ِيلِ?يمُ|يلِ?يمُ))|ِ?س(?:َالة\s*[إا]لى\s*ف(?:ِيلِ?يمُ|يلِ?يمُ)|الة\s*[إا]لى\s*ف(?:ِيلِ?يمُ|يلِ?يمُ)))ن|الر(?:ِ?ّس(?:َالة\s*[إا]لى\s*ف(?:ِيلِ?يمن|يلِ?يمن)|الة\s*[إا]لى\s*ف(?:ِيلِ?يمن|يلِ?يمن))|ِ?س(?:َالة\s*[إا]لى\s*ف(?:ِيلِ?يمن|يلِ?يمن)|الة\s*[إا]لى\s*ف(?:ِيلِ?يمن|يلِ?يمن)))|رسالة\s*بولس\s*[إا]لى\s*فيلمون|ف(?:ِل(?:ِيمُ?ونَ|يمُ?ونَ)|ل(?:ِيمُ?ونَ|يمُ?ونَ))|ف(?:ِل(?:ِيمُ?ون|يمُ?ون)|ل(?:ِيمُ?ون|(?:يمُ?ون)?))|Filimon|فيلمون|فلمون))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Heb"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:(?:الر(?:ِ?ّس(?:َالة\s*[إا]لى\s*الع(?:ِبران(?:ِيِ?ّ|يِ?ّ)|بران(?:ِيِ?ّ|يِ?ّ))|الة\s*[إا]لى\s*الع(?:ِبران(?:ِيِ?ّ|يِ?ّ)|بران(?:ِيِ?ّ|يِ?ّ)))|ِ?س(?:َالة\s*[إا]لى\s*الع(?:ِبران(?:ِيِ?ّ|يِ?ّ)|بران(?:ِيِ?ّ|يِ?ّ))|الة\s*[إا]لى\s*الع(?:ِبران(?:ِيِ?ّ|يِ?ّ)|بران(?:ِيِ?ّ|يِ?ّ))))|ع(?:ِبر(?:َانِ?ي|انِ?ي)|بر(?:َانِ?ي|انِ?ي))ّ)ين|(?:الر(?:ِ?ّس(?:َالة\s*[إا]لى\s*الع(?:ِبران(?:ِيِ?ي|يِ?ي)|بران(?:ِيِ?ي|يِ?ي))|الة\s*[إا]لى\s*الع(?:ِبران(?:ِيِ?ي|يِ?ي)|بران(?:ِيِ?ي|يِ?ي)))|ِ?س(?:َالة\s*[إا]لى\s*الع(?:ِبران(?:ِيِ?ي|يِ?ي)|بران(?:ِيِ?ي|يِ?ي))|الة\s*[إا]لى\s*الع(?:ِبران(?:ِيِ?ي|يِ?ي)|بران(?:ِيِ?ي|يِ?ي))))|ع(?:ِبر(?:َانِ?ي|انِ?ي)|بر(?:َانِ?ي|انِ?ي))ي)ن|رسالة\s*[إا]لى\s*العبرانيين|من\s*رسالة\s*العبرانيين|ٱل(?:ْع(?:ِب(?:ْر(?:َان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ)|ان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ))|ر(?:َان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ)|ان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ)))|ب(?:ْر(?:َان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ)|ان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ))|ر(?:َان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ)|ان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ))))|ع(?:ِب(?:ْر(?:َان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ)|ان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ))|ر(?:َان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ)|ان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ)))|ب(?:ْر(?:َان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ)|ان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ))|ر(?:َان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ)|ان(?:ِي(?:ِ?ّ|ِ?)ينَ|ي(?:ِ?ّ|ِ?)ينَ)))))|ٱل(?:ْع(?:ِب(?:ْر(?:َان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين)|ان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين))|ر(?:َان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين)|ان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين)))|ب(?:ْر(?:َان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين)|ان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين))|ر(?:َان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين)|ان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين))))|ع(?:ِب(?:ْر(?:َان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين)|ان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين))|ر(?:َان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين)|ان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين)))|ب(?:ْر(?:َان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين)|ان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين))|ر(?:َان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين)|ان(?:ِي(?:ِ?ّ|ِ?)ين|ي(?:ِ?ّ|ِ?)ين)))))|العِ?براني(?:ِ?ّ|ِ?)ينَ|العِ?براني(?:ِ?ّ|ِ?)ين|3ebraniyyin|عب))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jas"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ر(?:ِسَالَةُ\s*القِدِّيس\s*يَعْقُ|سالة\s*(?:القديس\s*)?يعق)وب|ي(?:َع(?:ْقُ?وبَ|قُ?وبَ)|ع(?:ْقُ?وبَ|قُ?وبَ))|ي(?:َع(?:ْقُ?وب|قُ?وب)|ع(?:ْقُ?وب|(?:قُ?وب)?))|Ya3koub))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Pet"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ب(?:ُط(?:ْر(?:ُس(?:َ\s*ٱل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى))|\s*ٱل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى)))|س(?:َ\s*ٱل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى))|\s*ٱل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى))))|ر(?:ُسَ?\s*ٱ|سَ?\s*ٱ)ل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى))|ر(?:ُس(?:َ\s*ال[أا]|\s*ال[أا])|س(?:َ\s*ال[أا]|\s*ال[أا]))ولَ?ى)|ط(?:ْر(?:ُس(?:َ\s*ٱل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى))|\s*ٱل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى)))|س(?:َ\s*ٱل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى))|\s*ٱل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى))))|ر(?:ُسَ?\s*ٱ|سَ?\s*ٱ)ل(?:ْ[أا](?:ُولَ?ى|ولَ?ى)|[أا](?:ُولَ?ى|ولَ?ى))|ر(?:ُس(?:َ\s*ال[أا]|\s*ال[أا])|س(?:َ\s*ال[أا]|\s*ال[أا]))ولَ?ى))|صخر\s*ال[أا]ولى|1بط(?:رس)?))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Pet"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:ب(?:ُط(?:ْرُسَ\s*ٱلثَّانِيَةُ|ر(?:(?:ُس(?:َ\s*الثّ?انيةُ|\s*الثّ?انيةُ)|س(?:َ\s*الثّ?انيةُ|\s*الثّ?انيةُ))|(?:ُس(?:َ\s*الثّ?انية|\s*الثّ?انية)|س(?:َ\s*الثّ?انية|\s*الثّ?انية))))|طر(?:(?:ُس(?:َ\s*الثّ?انيةُ|\s*الثّ?انيةُ)|س(?:َ\s*الثّ?انيةُ|\s*(?:الثّ?انيةُ|ٱلثانية)))|(?:ُس(?:َ\s*الثّ?انية|\s*الثّ?انية)|س(?:َ\s*الثّ?انية|\s*الثّ?انية))))|صخر\s*الثانية|2بطرس|2بط))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Pet"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:رِسَالَةُ\.?\s*القِدِّيس\s*بُطْرُسَ\s*الأ|(?:رسالة(?:\.\s*الق(?:ِد(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ))|ِ?يس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ)))|د(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ))|ِ?يس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ))))|\s*الق(?:ِد(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ))|ِ?يس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ)))|د(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ))|ِ?يس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ)))))|(?:سفر|(?:من|1))\.\s*الق(?:ِد(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ))|ِ?يس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ)))|د(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ))|ِ?يس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ))))|(?:سفر|(?:من|1))\s*الق(?:ِد(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ))|ِ?يس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ)))|د(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ))|ِ?يس\s*ب(?:ُط(?:ْرُ?سَ|رُ?سَ)|ط(?:ْرُ?سَ|رُ?سَ)))))\s*ال[أا]|(?:رسالة(?:\.\s*الق(?:ِد(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*))|ِ?يس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*)))|د(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*))|ِ?يس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*))))|\s*الق(?:ِد(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*))|ِ?يس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*)))|د(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*))|ِ?يس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*)))))|(?:سفر|(?:من|1))\.\s*الق(?:ِد(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*))|ِ?يس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*)))|د(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*))|ِ?يس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*))))|(?:سفر|(?:من|1))\s*الق(?:ِد(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*))|ِ?يس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*)))|د(?:ِ?ّيس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*))|ِ?يس\s*ب(?:ُط(?:ْرُ?س\s*|رُ?س\s*)|ط(?:ْرُ?س\s*|رُ?س\s*))))|(?:رِسَالَةُ\.?\s*ب|ر(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*ب|ِس(?:(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)ب|َال(?:(?:ةُ?\.\s*|ةُ?\s*)ب|َة\.?\s*ب))|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*)ب|سالة\.?\s*ب)|(?:(?:سفر|(?:من|1))\.|(?:سفر|(?:من|1)))\s*ب)طرس\s*)ال[أا]|(?:رِسَالَةُ\.?\s*ر|ر(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*ر|ِس(?:(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)ر|َال(?:(?:ةُ?\.\s*|ةُ?\s*)ر|َة\.?\s*ر))|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*)ر|سالة\.?\s*ر)|(?:(?:سفر|(?:من|1))\.|(?:سفر|(?:من|1)))\s*ر)سالة\s*صخر\s*ال[أا])ولى|ال(?:(?:أولى\.?\s*القِدِّيس\s*بُطْرُسَ\s*الأ|أولى\.?\s*رسالة\s*صخر\s*ال[أا]|أولى\.?\s*بطرس\s*ال[أا])ولى|اولى(?:\.\s*(?:القديس\s*بطرس\s*الاولى|(?:رسالة\s*صخر\s*ال[أا]|بطرس\s*ال[أا])ولى|Boutros|بط(?:رس)?)|\s*(?:القديس\s*بطرس\s*الاولى|(?:رسالة\s*صخر\s*ال[أا]|بطرس\s*ال[أا])ولى|Boutros|بط(?:رس)?))|أولى\.?\s*Boutros|أولى\.?\s*بط(?:رس)?)|(?:رِسَالَةُ\.?\s*B|ر(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*B|ِس(?:(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)B|َال(?:(?:ةُ?\.\s*|ةُ?\s*)B|َة\.?\s*B))|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*)B|سالة\.?\s*B)|(?:(?:سفر|(?:من|1))\.|(?:سفر|(?:من|1)))\s*B)outros|(?:رِسَالَةُ\.?\s*ب|ر(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*ب|ِس(?:(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)ب|َال(?:(?:ةُ?\.\s*|ةُ?\s*)ب|َة\.?\s*ب))|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*)ب|سالة\.?\s*ب)|(?:(?:سفر|(?:من|1))\.|(?:سفر|(?:من|1)))\s*ب)ط(?:رس)?))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Pet"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:رِسَالَةُ\.?\s*القِدِّيس\s*بُطْرُسَ\s*الثَّانِيَة|الثانية(?:\.\s*(?:الق(?:ِدِّيس\s*بُطْرُسَ\s*الثَّانِيَ|ديس\s*بطرس\s*الثاني)ة|بطرس\s*الثانية|Boutros|بط(?:رس)?)|\s*(?:الق(?:ِدِّيس\s*بُطْرُسَ\s*الثَّانِيَ|ديس\s*بطرس\s*الثاني)ة|بطرس\s*الثانية|Boutros|بط(?:رس)?))|رسالة\.\s*(?:الق(?:ِدِّيس\s*بُطْرُسَ\s*الثَّانِيَ|ديس\s*بطرس\s*الثاني)ة|بطرس\s*الثانية|Boutros|بط(?:رس)?)|رسالة\s*(?:الق(?:ِدِّيس\s*بُطْرُسَ\s*الثَّانِيَ|ديس\s*بطرس\s*الثاني)ة|بطرس\s*الثانية|Boutros|بط(?:رس)?)|(?:سفر|من|2)(?:\.\s*(?:الق(?:ِدِّيس\s*بُطْرُسَ\s*الثَّانِيَ|ديس\s*بطرس\s*الثاني)ة|بطرس\s*الثانية|Boutros|بط(?:رس)?)|\s*(?:الق(?:ِدِّيس\s*بُطْرُسَ\s*الثَّانِيَ|ديس\s*بطرس\s*الثاني)ة|بطرس\s*الثانية|Boutros|بط(?:رس)?))|ر(?:ِس(?:َال(?:َة(?:ُ\.?\s*ب|\.?\s*ب)|(?:ةُ?\.\s*|ةُ?\s*)ب)|(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)ب)|(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*))ب)طرس\s*الثانية|ر(?:ِس(?:َال(?:َة(?:ُ\.?\s*B|\.?\s*B)|(?:ةُ?\.\s*|ةُ?\s*)B)|(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)B)|(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*))B)outros|ر(?:ِس(?:َال(?:َة(?:ُ\.?\s*ب|\.?\s*ب)|(?:ةُ?\.\s*|ةُ?\s*)ب)|(?:الَ?ةُ?\.\s*|الَ?ةُ?\s*)ب)|(?:(?:س(?:َالَ?ة|الَة)ُ?\.|سالةُ\.)\s*|(?:س(?:َالَ?ة|الَة)ُ?\s*|سالةُ\s*))ب)ط(?:رس)?))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jude"],
            testament: "n",
            regexp: /(?:^|(?<=[^\p{L}]))((?:ر(?:ِسَالَةُ\s*القِدِّيس\s*يَهُوذَ|سالة\s*(?:القديس\s*)?يهوذ)ا|ي(?:َهُ?وذَ|هُ?وذَ)ا|ي(?:َهُ?وذا|هُ?وذا)|Yahouza|يه))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Tob"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(طو(?:بيّ?ا)?)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Jdt"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(يه(?:وديت)?)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["Bar"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}]))(با(?:روك)?)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:ر(?:ِس(?:َالَ?ةُ|الَ?ةُ)|س(?:َالَ?ةُ|الَ?ةُ))|سفر|من|1)\.?\s*مك|(?:ر(?:ِس(?:َالَ?ة\.|الَ?ة\.)|س(?:َالَ?ة\.|الَ?ة\.))\s*|ر(?:ِس(?:َالَ?ة\s*|الَ?ة\s*)|س(?:َالَ?ة\s*|الَ?ة\s*)))مك|ال[أا]ولى\.?\s*مك))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))((?:(?:ر(?:ِس(?:َالَ?ةُ|الَ?ةُ)|س(?:َالَ?ةُ|الَ?ةُ))|سفر|من|2)\.?\s*مك|(?:ر(?:ِس(?:َالَ?ة\.|الَ?ة\.)|س(?:َالَ?ة\.|الَ?ة\.))\s*|ر(?:ِس(?:َالَ?ة\s*|الَ?ة\s*)|س(?:َالَ?ة\s*|الَ?ة\s*)))مك|الثانية\.?\s*مك))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["1Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(المك(?:ّابي(?:ّين\s*ال[أا]وّ?ل|ين\s*ال[أا]وّ?ل)|ابي(?:ّين\s*ال[أا]وّ?ل|ين\s*ال[أا]وّ?ل)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["2Macc"],
            testament: "a",
            regexp: /(?:^|(?<=[^\p{L}\p{N}])(?<!\d:(?=\d)))(المكاب(?:يّ?|ـي)ين\s*الثاني)(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["DanGr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))(دا(?:نيال(?:\s*يوناني)?|\s*\(يو\)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          },
          {
            osis: ["EsthGr"],
            testament: "o",
            regexp: /(?:^|(?<=[^\p{L}]))([أا]س(?:تير(?:\s*يوناني)?|\s*\(يو\)))(?:(?=[\d\s\.?:,;\x1e\x1f&\(\)（）\[\]\/"’'\*=~\-–—])|$)/giu
          }
        ];
  }
};

var bcv_translations = class {
  constructor() {
    this.aliases = { current: { system: "current", osis: "" }, default: { system: "default", osis: "" } };
    this.current_system = "default";
    this.systems = {
          current: {},
          default: {
            order: {
              Gen: 1,
              Exod: 2,
              Lev: 3,
              Num: 4,
              Deut: 5,
              Josh: 6,
              Judg: 7,
              Ruth: 8,
              "1Sam": 9,
              "2Sam": 10,
              "1Kgs": 11,
              "2Kgs": 12,
              "1Chr": 13,
              "2Chr": 14,
              Ezra: 15,
              Neh: 16,
              Esth: 17,
              Job: 18,
              Ps: 19,
              Prov: 20,
              Eccl: 21,
              Song: 22,
              Isa: 23,
              Jer: 24,
              Lam: 25,
              Ezek: 26,
              Dan: 27,
              Hos: 28,
              Joel: 29,
              Amos: 30,
              Obad: 31,
              Jonah: 32,
              Mic: 33,
              Nah: 34,
              Hab: 35,
              Zeph: 36,
              Hag: 37,
              Zech: 38,
              Mal: 39,
              Matt: 40,
              Mark: 41,
              Luke: 42,
              John: 43,
              Acts: 44,
              Rom: 45,
              "1Cor": 46,
              "2Cor": 47,
              Gal: 48,
              Eph: 49,
              Phil: 50,
              Col: 51,
              "1Thess": 52,
              "2Thess": 53,
              "1Tim": 54,
              "2Tim": 55,
              Titus: 56,
              Phlm: 57,
              Heb: 58,
              Jas: 59,
              "1Pet": 60,
              "2Pet": 61,
              "1John": 62,
              "2John": 63,
              "3John": 64,
              Jude: 65,
              Rev: 66,
              Tob: 67,
              Jdt: 68,
              GkEsth: 69,
              Wis: 70,
              Sir: 71,
              Bar: 72,
              PrAzar: 73,
              Sus: 74,
              Bel: 75,
              SgThree: 76,
              EpJer: 77,
              "1Macc": 78,
              "2Macc": 79,
              "3Macc": 80,
              "4Macc": 81,
              "1Esd": 82,
              "2Esd": 83,
              PrMan: 84
            },
            chapters: {
              Gen: [31, 25, 24, 26, 32, 22, 24, 22, 29, 32, 32, 20, 18, 24, 21, 16, 27, 33, 38, 18, 34, 24, 20, 67, 34, 35, 46, 22, 35, 43, 55, 32, 20, 31, 29, 43, 36, 30, 23, 23, 57, 38, 34, 34, 28, 34, 31, 22, 33, 26],
              Exod: [22, 25, 22, 31, 23, 30, 25, 32, 35, 29, 10, 51, 22, 31, 27, 36, 16, 27, 25, 26, 36, 31, 33, 18, 40, 37, 21, 43, 46, 38, 18, 35, 23, 35, 35, 38, 29, 31, 43, 38],
              Lev: [17, 16, 17, 35, 19, 30, 38, 36, 24, 20, 47, 8, 59, 57, 33, 34, 16, 30, 37, 27, 24, 33, 44, 23, 55, 46, 34],
              Num: [54, 34, 51, 49, 31, 27, 89, 26, 23, 36, 35, 16, 33, 45, 41, 50, 13, 32, 22, 29, 35, 41, 30, 25, 18, 65, 23, 31, 40, 16, 54, 42, 56, 29, 34, 13],
              Deut: [46, 37, 29, 49, 33, 25, 26, 20, 29, 22, 32, 32, 18, 29, 23, 22, 20, 22, 21, 20, 23, 30, 25, 22, 19, 19, 26, 68, 29, 20, 30, 52, 29, 12],
              Josh: [18, 24, 17, 24, 15, 27, 26, 35, 27, 43, 23, 24, 33, 15, 63, 10, 18, 28, 51, 9, 45, 34, 16, 33],
              Judg: [36, 23, 31, 24, 31, 40, 25, 35, 57, 18, 40, 15, 25, 20, 20, 31, 13, 31, 30, 48, 25],
              Ruth: [22, 23, 18, 22],
              "1Sam": [28, 36, 21, 22, 12, 21, 17, 22, 27, 27, 15, 25, 23, 52, 35, 23, 58, 30, 24, 42, 15, 23, 29, 22, 44, 25, 12, 25, 11, 31, 13],
              "2Sam": [27, 32, 39, 12, 25, 23, 29, 18, 13, 19, 27, 31, 39, 33, 37, 23, 29, 33, 43, 26, 22, 51, 39, 25],
              "1Kgs": [53, 46, 28, 34, 18, 38, 51, 66, 28, 29, 43, 33, 34, 31, 34, 34, 24, 46, 21, 43, 29, 53],
              "2Kgs": [18, 25, 27, 44, 27, 33, 20, 29, 37, 36, 21, 21, 25, 29, 38, 20, 41, 37, 37, 21, 26, 20, 37, 20, 30],
              "1Chr": [54, 55, 24, 43, 26, 81, 40, 40, 44, 14, 47, 40, 14, 17, 29, 43, 27, 17, 19, 8, 30, 19, 32, 31, 31, 32, 34, 21, 30],
              "2Chr": [17, 18, 17, 22, 14, 42, 22, 18, 31, 19, 23, 16, 22, 15, 19, 14, 19, 34, 11, 37, 20, 12, 21, 27, 28, 23, 9, 27, 36, 27, 21, 33, 25, 33, 27, 23],
              Ezra: [11, 70, 13, 24, 17, 22, 28, 36, 15, 44],
              Neh: [11, 20, 32, 23, 19, 19, 73, 18, 38, 39, 36, 47, 31],
              Esth: [22, 23, 15, 17, 14, 14, 10, 17, 32, 3],
              Job: [22, 13, 26, 21, 27, 30, 21, 22, 35, 22, 20, 25, 28, 22, 35, 22, 16, 21, 29, 29, 34, 30, 17, 25, 6, 14, 23, 28, 25, 31, 40, 22, 33, 37, 16, 33, 24, 41, 30, 24, 34, 17],
              Ps: [6, 12, 8, 8, 12, 10, 17, 9, 20, 18, 7, 8, 6, 7, 5, 11, 15, 50, 14, 9, 13, 31, 6, 10, 22, 12, 14, 9, 11, 12, 24, 11, 22, 22, 28, 12, 40, 22, 13, 17, 13, 11, 5, 26, 17, 11, 9, 14, 20, 23, 19, 9, 6, 7, 23, 13, 11, 11, 17, 12, 8, 12, 11, 10, 13, 20, 7, 35, 36, 5, 24, 20, 28, 23, 10, 12, 20, 72, 13, 19, 16, 8, 18, 12, 13, 17, 7, 18, 52, 17, 16, 15, 5, 23, 11, 13, 12, 9, 9, 5, 8, 28, 22, 35, 45, 48, 43, 13, 31, 7, 10, 10, 9, 8, 18, 19, 2, 29, 176, 7, 8, 9, 4, 8, 5, 6, 5, 6, 8, 8, 3, 18, 3, 3, 21, 26, 9, 8, 24, 13, 10, 7, 12, 15, 21, 10, 20, 14, 9, 6],
              Prov: [33, 22, 35, 27, 23, 35, 27, 36, 18, 32, 31, 28, 25, 35, 33, 33, 28, 24, 29, 30, 31, 29, 35, 34, 28, 28, 27, 28, 27, 33, 31],
              Eccl: [18, 26, 22, 16, 20, 12, 29, 17, 18, 20, 10, 14],
              Song: [17, 17, 11, 16, 16, 13, 13, 14],
              Isa: [31, 22, 26, 6, 30, 13, 25, 22, 21, 34, 16, 6, 22, 32, 9, 14, 14, 7, 25, 6, 17, 25, 18, 23, 12, 21, 13, 29, 24, 33, 9, 20, 24, 17, 10, 22, 38, 22, 8, 31, 29, 25, 28, 28, 25, 13, 15, 22, 26, 11, 23, 15, 12, 17, 13, 12, 21, 14, 21, 22, 11, 12, 19, 12, 25, 24],
              Jer: [19, 37, 25, 31, 31, 30, 34, 22, 26, 25, 23, 17, 27, 22, 21, 21, 27, 23, 15, 18, 14, 30, 40, 10, 38, 24, 22, 17, 32, 24, 40, 44, 26, 22, 19, 32, 21, 28, 18, 16, 18, 22, 13, 30, 5, 28, 7, 47, 39, 46, 64, 34],
              Lam: [22, 22, 66, 22, 22],
              Ezek: [28, 10, 27, 17, 17, 14, 27, 18, 11, 22, 25, 28, 23, 23, 8, 63, 24, 32, 14, 49, 32, 31, 49, 27, 17, 21, 36, 26, 21, 26, 18, 32, 33, 31, 15, 38, 28, 23, 29, 49, 26, 20, 27, 31, 25, 24, 23, 35],
              Dan: [21, 49, 30, 37, 31, 28, 28, 27, 27, 21, 45, 13],
              Hos: [11, 23, 5, 19, 15, 11, 16, 14, 17, 15, 12, 14, 16, 9],
              Joel: [20, 32, 21],
              Amos: [15, 16, 15, 13, 27, 14, 17, 14, 15],
              Obad: [21],
              Jonah: [17, 10, 10, 11],
              Mic: [16, 13, 12, 13, 15, 16, 20],
              Nah: [15, 13, 19],
              Hab: [17, 20, 19],
              Zeph: [18, 15, 20],
              Hag: [15, 23],
              Zech: [21, 13, 10, 14, 11, 15, 14, 23, 17, 12, 17, 14, 9, 21],
              Mal: [14, 17, 18, 6],
              Matt: [25, 23, 17, 25, 48, 34, 29, 34, 38, 42, 30, 50, 58, 36, 39, 28, 27, 35, 30, 34, 46, 46, 39, 51, 46, 75, 66, 20],
              Mark: [45, 28, 35, 41, 43, 56, 37, 38, 50, 52, 33, 44, 37, 72, 47, 20],
              Luke: [80, 52, 38, 44, 39, 49, 50, 56, 62, 42, 54, 59, 35, 35, 32, 31, 37, 43, 48, 47, 38, 71, 56, 53],
              John: [51, 25, 36, 54, 47, 71, 53, 59, 41, 42, 57, 50, 38, 31, 27, 33, 26, 40, 42, 31, 25],
              Acts: [26, 47, 26, 37, 42, 15, 60, 40, 43, 48, 30, 25, 52, 28, 41, 40, 34, 28, 41, 38, 40, 30, 35, 27, 27, 32, 44, 31],
              Rom: [32, 29, 31, 25, 21, 23, 25, 39, 33, 21, 36, 21, 14, 23, 33, 27],
              "1Cor": [31, 16, 23, 21, 13, 20, 40, 13, 27, 33, 34, 31, 13, 40, 58, 24],
              "2Cor": [24, 17, 18, 18, 21, 18, 16, 24, 15, 18, 33, 21, 14],
              Gal: [24, 21, 29, 31, 26, 18],
              Eph: [23, 22, 21, 32, 33, 24],
              Phil: [30, 30, 21, 23],
              Col: [29, 23, 25, 18],
              "1Thess": [10, 20, 13, 18, 28],
              "2Thess": [12, 17, 18],
              "1Tim": [20, 15, 16, 16, 25, 21],
              "2Tim": [18, 26, 17, 22],
              Titus: [16, 15, 15],
              Phlm: [25],
              Heb: [14, 18, 19, 16, 14, 20, 28, 13, 28, 39, 40, 29, 25],
              Jas: [27, 26, 18, 17, 20],
              "1Pet": [25, 25, 22, 19, 14],
              "2Pet": [21, 22, 18],
              "1John": [10, 29, 24, 21, 21],
              "2John": [13],
              "3John": [15],
              Jude: [25],
              Rev: [20, 29, 22, 11, 14, 17, 17, 13, 21, 11, 19, 17, 18, 20, 8, 21, 18, 24, 21, 15, 27, 21],
              Tob: [22, 14, 17, 21, 22, 18, 16, 21, 6, 13, 18, 22, 17, 15],
              Jdt: [16, 28, 10, 15, 24, 21, 32, 36, 14, 23, 23, 20, 20, 19, 14, 25],
              GkEsth: [22, 23, 15, 17, 14, 14, 10, 17, 32, 13, 12, 6, 18, 19, 16, 24],
              Wis: [16, 24, 19, 20, 23, 25, 30, 21, 18, 21, 26, 27, 19, 31, 19, 29, 21, 25, 22],
              Sir: [30, 18, 31, 31, 15, 37, 36, 19, 18, 31, 34, 18, 26, 27, 20, 30, 32, 33, 30, 31, 28, 27, 27, 34, 26, 29, 30, 26, 28, 25, 31, 24, 33, 31, 26, 31, 31, 34, 35, 30, 22, 25, 33, 23, 26, 20, 25, 25, 16, 29, 30],
              Bar: [22, 35, 37, 37, 9],
              PrAzar: [68],
              Sus: [64],
              Bel: [42],
              SgThree: [39],
              EpJer: [73],
              "1Macc": [64, 70, 60, 61, 68, 63, 50, 32, 73, 89, 74, 53, 53, 49, 41, 24],
              "2Macc": [36, 32, 40, 50, 27, 31, 42, 36, 29, 38, 38, 45, 26, 46, 39],
              "3Macc": [29, 33, 30, 21, 51, 41, 23],
              "4Macc": [35, 24, 21, 26, 38, 35, 23, 29, 32, 21, 27, 19, 27, 20, 32, 25, 24, 24],
              "1Esd": [58, 30, 24, 63, 73, 34, 15, 96, 55],
              "2Esd": [40, 48, 36, 52, 56, 59, 70, 63, 47, 59, 46, 51, 58, 48, 63, 78],
              PrMan: [15],
              Ps151: [7]
            }
          }
        };
    this.systems.current = structuredClone(this.systems.default);
  }
};

var bcv_grammar_options_default = {
  ab: /^(?:(?:a|b|c|d|e))(?!\p{L})/iu,
  and: /^(?:(?:(?:&\.?\s*)|&))/i,
  c_explicit: /^[\s*]*(?:(?:chapter\.?\s*))[\s*]*/i,
  c_sep_eu: /^\x1f\x1f\x1f/i,
  c_sep_us: /^\x1f\x1f\x1f/i,
  cv_sep_weak: /^(?:[\s*]*["'][\s*]*|[\s*])+/i,
  cv_sep_eu: /^[\s*]*,+[\s*]*/i,
  cv_sep_us: /^[\s*]*(?::+|\.(?!\s*\.\s*\.))[\s*]*/i,
  ff: /^[\s*]*(?:(?:ff\.?\s*))(?![\p{L}\p{N}])(?:\.(?!\s*\.))?/iu,
  in_book_of: /^[\s*]*(?:from|of|in)[\s*]*(?:the[\s*]*book[\s*]*of[\s*]*)?/i,
  next: /^(?:\x1f\x1f\x1f)/i,
  ordinal: /^(?:th|st|nd|rd)/i,
  range: /^[\s*]*(?:[\-–—]|(?:[\-–—]\.?\s*))+[\s*]*/i,
  sequence_eu: /^(?:[;/:&\-–—~\s*]|\.(?!\s*\.\s*\.)|(?:&\.?\s*))+/i,
  sequence_us: /^(?:[,;/:&\-–—~\s*]|\.(?!\s*\.\s*\.)|(?:&\.?\s*))+/i,
  space: /^[\s*]+/,
  title: /^[\s*]*(?:(?:title\.?\s*))(?!\p{L})[\s*]*/iu,
  v_explicit: /^[\s*]*(?:(?:verse\.?\s*))[\s*]*(?!\p{L})/iu
};
var regexps = bcv_regexps;
var translations = bcv_translations;
var grammar_options = bcv_grammar_options_default;
export {
  grammar_options,
  regexps,
  translations
};